[Killed] BlockStatement
src/SymbolTable.ts:6:16
 
 class Stack<T> {
 	list: Array<T>;
-	constructor() {
-		this.list = [];
-	}
+	constructor() {}
 	push(el: T) {
 		this.list.push(el);
killedBy: Parsing tests should fail on empty input
statusReason: expected 2 to equal 1

[Killed] ArrayDeclaration
src/SymbolTable.ts:7:15
 class Stack<T> {
 	list: Array<T>;
 	constructor() {
-		this.list = [];
+		this.list = ["Stryker was here"];
 	}
 	push(el: T) {
killedBy: Parsing tests builtinsErr
statusReason: expected 3 to equal 12

[Killed] BlockStatement
src/SymbolTable.ts:9:14
 	constructor() {
 		this.list = [];
 	}
-	push(el: T) {
-		this.list.push(el);
-	}
+	push(el: T) {}
 	pop(): T {
 		return this.list.pop()!;
killedBy: Parsing tests builtins
statusReason: expected 47 to equal +0

[Survived] BlockStatement
src/SymbolTable.ts:12:11
 	push(el: T) {
 		this.list.push(el);
 	}
-	pop(): T {
-		return this.list.pop()!;
-	}
+	pop(): T {}
 	at(i: number): T | undefined {
 		return this.list.at(i);

[Killed] BlockStatement
src/SymbolTable.ts:15:31
 	pop(): T {
 		return this.list.pop()!;
 	}
-	at(i: number): T | undefined {
-		return this.list.at(i);
-	}
+	at(i: number): T | undefined {}
 }
 
killedBy: Parsing tests builtins
statusReason: expected 47 to equal +0

[Killed] BlockStatement
src/SymbolTable.ts:22:16
 
 export class SymbolTable {
 	scopes: Stack<Map<string, [Type, DiagnosticInfo<AstNode>]>>;
-	constructor() {
-		this.scopes = new Stack<Map<string, [Type, DiagnosticInfo<AstNode>]>>();
-	}
+	constructor() {}
 	beginScope() {
 		this.scopes.push(new Map());
killedBy: Parsing tests should fail on empty input
statusReason: expected 2 to equal 1

[Killed] BlockStatement
src/SymbolTable.ts:25:15
 	constructor() {
 		this.scopes = new Stack<Map<string, [Type, DiagnosticInfo<AstNode>]>>();
 	}
-	beginScope() {
-		this.scopes.push(new Map());
-	}
+	beginScope() {}
 
 	/**
killedBy: Parsing tests builtins
statusReason: expected 47 to equal +0

[Survived] BlockStatement
src/SymbolTable.ts:34:13
 	 *
 	 * @throws EmptyStackException if the scope stack is empty
 	 */
-	endScope() {
-		this.scopes.pop();
-	}
+	endScope() {}
 
 	/**

[Killed] BlockStatement
src/SymbolTable.ts:43:65
 	 *
 	 * @throws EmptyStackException if the scopes stack is empty.
 	 */
-	put(symbol: string, type: Type, info: DiagnosticInfo<AstNode>) {
-		this.scopes.at(-1)?.set(symbol, [type, info]);
-	}
+	put(symbol: string, type: Type, info: DiagnosticInfo<AstNode>) {}
 
 	inScope(symbol: string): boolean {
killedBy: Parsing tests builtins
statusReason: expected 47 to equal +0

[Killed] UnaryOperator
src/SymbolTable.ts:44:18
 	 * @throws EmptyStackException if the scopes stack is empty.
 	 */
 	put(symbol: string, type: Type, info: DiagnosticInfo<AstNode>) {
-		this.scopes.at(-1)?.set(symbol, [type, info]);
+		this.scopes.at(+1)?.set(symbol, [type, info]);
 	}
 
killedBy: Parsing tests controlflow
statusReason: expected 3 to equal +0

[Survived] OptionalChaining
src/SymbolTable.ts:44:3
 	 * @throws EmptyStackException if the scopes stack is empty.
 	 */
 	put(symbol: string, type: Type, info: DiagnosticInfo<AstNode>) {
-		this.scopes.at(-1)?.set(symbol, [type, info]);
+		this.scopes.at(-1).set(symbol, [type, info]);
 	}
 

[Killed] BlockStatement
src/SymbolTable.ts:47:35
 		this.scopes.at(-1)?.set(symbol, [type, info]);
 	}
 
-	inScope(symbol: string): boolean {
-		console.error(this.scopes.list);
-		for (const scope of this.scopes.list) {
-			for (const s of scope.keys()) {
-				if (s === symbol) {
-					return true;
-				}
-			}
-		}
-		return false;
-	}
+	inScope(symbol: string): boolean {}
 
 	type(symbol: string): Type | undefined {
killedBy: Parsing tests builtins
statusReason: expected 15 to equal +0

[Killed] BlockStatement
src/SymbolTable.ts:49:41
 
 	inScope(symbol: string): boolean {
 		console.error(this.scopes.list);
-		for (const scope of this.scopes.list) {
-			for (const s of scope.keys()) {
-				if (s === symbol) {
-					return true;
-				}
-			}
-		}
+		for (const scope of this.scopes.list) {}
 		return false;
 	}
killedBy: Parsing tests builtins
statusReason: expected 15 to equal +0

[Killed] BlockStatement
src/SymbolTable.ts:50:34
 	inScope(symbol: string): boolean {
 		console.error(this.scopes.list);
 		for (const scope of this.scopes.list) {
-			for (const s of scope.keys()) {
-				if (s === symbol) {
-					return true;
-				}
-			}
+			for (const s of scope.keys()) {}
 		}
 		return false;
killedBy: Parsing tests builtins
statusReason: expected 15 to equal +0

[Killed] ConditionalExpression
src/SymbolTable.ts:51:9
 		console.error(this.scopes.list);
 		for (const scope of this.scopes.list) {
 			for (const s of scope.keys()) {
-				if (s === symbol) {
+				if (false) {
 					return true;
 				}
killedBy: Parsing tests builtins
statusReason: expected 15 to equal +0

[Killed] BlockStatement
src/SymbolTable.ts:51:23
 		console.error(this.scopes.list);
 		for (const scope of this.scopes.list) {
 			for (const s of scope.keys()) {
-				if (s === symbol) {
-					return true;
-				}
+				if (s === symbol) {}
 			}
 		}
killedBy: Parsing tests builtins
statusReason: expected 15 to equal +0

[Killed] BooleanLiteral
src/SymbolTable.ts:52:13
 		for (const scope of this.scopes.list) {
 			for (const s of scope.keys()) {
 				if (s === symbol) {
-					return true;
+					return false;
 				}
 			}
killedBy: Parsing tests builtins
statusReason: expected 15 to equal +0

[Killed] BlockStatement
src/SymbolTable.ts:59:41
 		return false;
 	}
 
-	type(symbol: string): Type | undefined {
-		// Iterate backwards from the top of the stack to the bottom
-		for (let i = this.scopes.list.length - 1; i >= 0; i--) {
-			const scope = this.scopes.list[i];
-			if (scope.has(symbol)) {
-				return scope.get(symbol)?.[0];
-			}
-		}
-		return undefined;
-	}
+	type(symbol: string): Type | undefined {}
 
 	toString(): string {
killedBy: Parsing tests builtins
statusReason: expected 32 to equal +0

[Killed] ConditionalExpression
src/SymbolTable.ts:61:45
 
 	type(symbol: string): Type | undefined {
 		// Iterate backwards from the top of the stack to the bottom
-		for (let i = this.scopes.list.length - 1; i >= 0; i--) {
+		for (let i = this.scopes.list.length - 1; false; i--) {
 			const scope = this.scopes.list[i];
 			if (scope.has(symbol)) {
killedBy: Parsing tests builtins
statusReason: expected 32 to equal +0

[Killed] EqualityOperator
src/SymbolTable.ts:61:45
 
 	type(symbol: string): Type | undefined {
 		// Iterate backwards from the top of the stack to the bottom
-		for (let i = this.scopes.list.length - 1; i >= 0; i--) {
+		for (let i = this.scopes.list.length - 1; i > 0; i--) {
 			const scope = this.scopes.list[i];
 			if (scope.has(symbol)) {
killedBy: Parsing tests controlflow
statusReason: expected 2 to equal +0

[Killed] ConditionalExpression
src/SymbolTable.ts:63:8
 		// Iterate backwards from the top of the stack to the bottom
 		for (let i = this.scopes.list.length - 1; i >= 0; i--) {
 			const scope = this.scopes.list[i];
-			if (scope.has(symbol)) {
+			if (false) {
 				return scope.get(symbol)?.[0];
 			}
killedBy: Parsing tests builtins
statusReason: expected 32 to equal +0

[Killed] ConditionalExpression
src/SymbolTable.ts:63:8
 		// Iterate backwards from the top of the stack to the bottom
 		for (let i = this.scopes.list.length - 1; i >= 0; i--) {
 			const scope = this.scopes.list[i];
-			if (scope.has(symbol)) {
+			if (true) {
 				return scope.get(symbol)?.[0];
 			}
killedBy: Parsing tests controlflow
statusReason: expected 5 to equal +0

[Survived] OptionalChaining
src/SymbolTable.ts:64:12
 		for (let i = this.scopes.list.length - 1; i >= 0; i--) {
 			const scope = this.scopes.list[i];
 			if (scope.has(symbol)) {
-				return scope.get(symbol)?.[0];
+				return scope.get(symbol)[0];
 			}
 		}

[NoCoverage] BlockStatement
src/SymbolTable.ts:70:21
 		return undefined;
 	}
 
-	toString(): string {
-		let retString = "";
-		for (var scope of this.scopes.list) {
-			retString += `${Object.values(scope).join("\n")}\n`;
-		}
-		return retString;
-	}
+	toString(): string {}
 }
 

[NoCoverage] StringLiteral
src/SymbolTable.ts:71:19
 	}
 
 	toString(): string {
-		let retString = "";
+		let retString = "Stryker was here!";
 		for (var scope of this.scopes.list) {
 			retString += `${Object.values(scope).join("\n")}\n`;

[NoCoverage] BlockStatement
src/SymbolTable.ts:72:39
 
 	toString(): string {
 		let retString = "";
-		for (var scope of this.scopes.list) {
-			retString += `${Object.values(scope).join("\n")}\n`;
-		}
+		for (var scope of this.scopes.list) {}
 		return retString;
 	}

[NoCoverage] StringLiteral
src/SymbolTable.ts:73:17
 	toString(): string {
 		let retString = "";
 		for (var scope of this.scopes.list) {
-			retString += `${Object.values(scope).join("\n")}\n`;
+			retString += ``;
 		}
 		return retString;
