[Survived] ObjectLiteral
src/generated/ast.ts:9:33
 /* eslint-disable */
 import * as langium from 'langium';
 
-export const RobotMlTerminals = {
-    FLOAT: /[0-9]+\.[0-9]+([eE][+-]?[0-9]+)?/,
-    BOOL: /true|false/,
-    ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,
-    INT: /[0-9]+/,
-    STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,
-    WS: /\s+/,
-    ML_COMMENT: /\/\*[\s\S]*?\*\//,
-    SL_COMMENT: /\/\/[^\n\r]*/,
-};
+export const RobotMlTerminals = {};
 
 export type RobotMlTerminalNames = keyof typeof RobotMlTerminals;

[Survived] Regex
src/generated/ast.ts:10:12
 import * as langium from 'langium';
 
 export const RobotMlTerminals = {
-    FLOAT: /[0-9]+\.[0-9]+([eE][+-]?[0-9]+)?/,
+    FLOAT: /[0-9]\.[0-9]+([eE][+-]?[0-9]+)?/,
     BOOL: /true|false/,
     ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,

[Survived] Regex
src/generated/ast.ts:10:12
 import * as langium from 'langium';
 
 export const RobotMlTerminals = {
-    FLOAT: /[0-9]+\.[0-9]+([eE][+-]?[0-9]+)?/,
+    FLOAT: /[0-9]+\.[0-9]+([eE][+-][0-9]+)?/,
     BOOL: /true|false/,
     ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,

[Survived] Regex
src/generated/ast.ts:12:9
 export const RobotMlTerminals = {
     FLOAT: /[0-9]+\.[0-9]+([eE][+-]?[0-9]+)?/,
     BOOL: /true|false/,
-    ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,
+    ID: /\^?([^a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,
     INT: /[0-9]+/,
     STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,

[Survived] Regex
src/generated/ast.ts:14:13
     BOOL: /true|false/,
     ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,
     INT: /[0-9]+/,
-    STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,
+    STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[^\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,
     WS: /\s+/,
     ML_COMMENT: /\/\*[\s\S]*?\*\//,

[Survived] Regex
src/generated/ast.ts:14:13
     BOOL: /true|false/,
     ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,
     INT: /[0-9]+/,
-    STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,
+    STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,
     WS: /\s+/,
     ML_COMMENT: /\/\*[\s\S]*?\*\//,

[Survived] Regex
src/generated/ast.ts:16:17
     INT: /[0-9]+/,
     STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,
     WS: /\s+/,
-    ML_COMMENT: /\/\*[\s\S]*?\*\//,
+    ML_COMMENT: /\/\*[\s\S]\*\//,
     SL_COMMENT: /\/\/[^\n\r]*/,
 };

[Survived] Regex
src/generated/ast.ts:16:17
     INT: /[0-9]+/,
     STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,
     WS: /\s+/,
-    ML_COMMENT: /\/\*[\s\S]*?\*\//,
+    ML_COMMENT: /\/\*[\S\S]*?\*\//,
     SL_COMMENT: /\/\/[^\n\r]*/,
 };

[Survived] Regex
src/generated/ast.ts:17:17
     STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,
     WS: /\s+/,
     ML_COMMENT: /\/\*[\s\S]*?\*\//,
-    SL_COMMENT: /\/\/[^\n\r]*/,
+    SL_COMMENT: /\/\/[\n\r]*/,
 };
 

[NoCoverage] BlockStatement
src/generated/ast.ts:84:67
     type: 'type'
 } as const;
 
-export function isArgumentDec(item: unknown): item is ArgumentDec {
-    return reflection.isInstance(item, ArgumentDec.$type);
-}
+export function isArgumentDec(item: unknown): item is ArgumentDec {}
 
 export interface Assignation extends Statement {

[NoCoverage] BlockStatement
src/generated/ast.ts:100:67
     variableRef: 'variableRef'
 } as const;
 
-export function isAssignation(item: unknown): item is Assignation {
-    return reflection.isInstance(item, Assignation.$type);
-}
+export function isAssignation(item: unknown): item is Assignation {}
 
 export interface Backward extends Movement {

[NoCoverage] BlockStatement
src/generated/ast.ts:113:61
     expression: 'expression'
 } as const;
 
-export function isBackward(item: unknown): item is Backward {
-    return reflection.isInstance(item, Backward.$type);
-}
+export function isBackward(item: unknown): item is Backward {}
 
 export interface BinaryExpr extends Expression {

[NoCoverage] BlockStatement
src/generated/ast.ts:131:65
     right: 'right'
 } as const;
 
-export function isBinaryExpr(item: unknown): item is BinaryExpr {
-    return reflection.isInstance(item, BinaryExpr.$type);
-}
+export function isBinaryExpr(item: unknown): item is BinaryExpr {}
 
 export type BinaryOp = '!' | '!=' | '%' | '&&' | '*' | '+' | '-' | '/' | '<' | '<=' | '==' | '>' | '>=' | '||';

[NoCoverage] BlockStatement
src/generated/ast.ts:148:55
     statements: 'statements'
 } as const;
 
-export function isBlock(item: unknown): item is Block {
-    return reflection.isInstance(item, Block.$type);
-}
+export function isBlock(item: unknown): item is Block {}
 
 export type Builtins = GetClock | GetSensor | GetSpeed;

[NoCoverage] BlockStatement
src/generated/ast.ts:158:61
     $type: 'Builtins'
 } as const;
 
-export function isBuiltins(item: unknown): item is Builtins {
-    return reflection.isInstance(item, Builtins.$type);
-}
+export function isBuiltins(item: unknown): item is Builtins {}
 
 export interface Condition extends Statement {

[NoCoverage] BlockStatement
src/generated/ast.ts:174:63
     conditions: 'conditions'
 } as const;
 
-export function isCondition(item: unknown): item is Condition {
-    return reflection.isInstance(item, Condition.$type);
-}
+export function isCondition(item: unknown): item is Condition {}
 
 export type Declaration = ArgumentDec | VariableDec;

[NoCoverage] BlockStatement
src/generated/ast.ts:184:67
     $type: 'Declaration'
 } as const;
 
-export function isDeclaration(item: unknown): item is Declaration {
-    return reflection.isInstance(item, Declaration.$type);
-}
+export function isDeclaration(item: unknown): item is Declaration {}
 
 export interface Expression extends langium.AstNode {

[NoCoverage] BlockStatement
src/generated/ast.ts:196:65
     $type: 'Expression'
 } as const;
 
-export function isExpression(item: unknown): item is Expression {
-    return reflection.isInstance(item, Expression.$type);
-}
+export function isExpression(item: unknown): item is Expression {}
 
 export interface FnReturn extends Statement {

[NoCoverage] BlockStatement
src/generated/ast.ts:210:61
     expression: 'expression'
 } as const;
 
-export function isFnReturn(item: unknown): item is FnReturn {
-    return reflection.isInstance(item, FnReturn.$type);
-}
+export function isFnReturn(item: unknown): item is FnReturn {}
 
 export interface Forward extends Movement {

[NoCoverage] BlockStatement
src/generated/ast.ts:223:59
     expression: 'expression'
 } as const;
 
-export function isForward(item: unknown): item is Forward {
-    return reflection.isInstance(item, Forward.$type);
-}
+export function isForward(item: unknown): item is Forward {}
 
 export interface FunctionCall extends Expression, Statement {

[NoCoverage] BlockStatement
src/generated/ast.ts:239:69
     parameters: 'parameters'
 } as const;
 
-export function isFunctionCall(item: unknown): item is FunctionCall {
-    return reflection.isInstance(item, FunctionCall.$type);
-}
+export function isFunctionCall(item: unknown): item is FunctionCall {}
 
 export interface FunctionDeclaration extends Statement {

[NoCoverage] BlockStatement
src/generated/ast.ts:260:83
     returnType: 'returnType'
 } as const;
 
-export function isFunctionDeclaration(item: unknown): item is FunctionDeclaration {
-    return reflection.isInstance(item, FunctionDeclaration.$type);
-}
+export function isFunctionDeclaration(item: unknown): item is FunctionDeclaration {}
 
 export interface GetClock extends Expression {

[NoCoverage] BlockStatement
src/generated/ast.ts:272:61
     $type: 'GetClock'
 } as const;
 
-export function isGetClock(item: unknown): item is GetClock {
-    return reflection.isInstance(item, GetClock.$type);
-}
+export function isGetClock(item: unknown): item is GetClock {}
 
 export interface GetSensor extends Expression {

[NoCoverage] BlockStatement
src/generated/ast.ts:286:63
     sensor: 'sensor'
 } as const;
 
-export function isGetSensor(item: unknown): item is GetSensor {
-    return reflection.isInstance(item, GetSensor.$type);
-}
+export function isGetSensor(item: unknown): item is GetSensor {}
 
 export interface GetSpeed extends Expression {

[NoCoverage] BlockStatement
src/generated/ast.ts:298:61
     $type: 'GetSpeed'
 } as const;
 
-export function isGetSpeed(item: unknown): item is GetSpeed {
-    return reflection.isInstance(item, GetSpeed.$type);
-}
+export function isGetSpeed(item: unknown): item is GetSpeed {}
 
 export interface Leftward extends Movement {

[NoCoverage] BlockStatement
src/generated/ast.ts:311:61
     expression: 'expression'
 } as const;
 
-export function isLeftward(item: unknown): item is Leftward {
-    return reflection.isInstance(item, Leftward.$type);
-}
+export function isLeftward(item: unknown): item is Leftward {}
 
 export interface Literal extends Expression {

[NoCoverage] BlockStatement
src/generated/ast.ts:325:59
     value: 'value'
 } as const;
 
-export function isLiteral(item: unknown): item is Literal {
-    return reflection.isInstance(item, Literal.$type);
-}
+export function isLiteral(item: unknown): item is Literal {}
 
 export interface Loop extends Statement {

[NoCoverage] BlockStatement
src/generated/ast.ts:341:53
     condition: 'condition'
 } as const;
 
-export function isLoop(item: unknown): item is Loop {
-    return reflection.isInstance(item, Loop.$type);
-}
+export function isLoop(item: unknown): item is Loop {}
 
 export interface Movement extends Statement {

[NoCoverage] BlockStatement
src/generated/ast.ts:355:61
     expression: 'expression'
 } as const;
 
-export function isMovement(item: unknown): item is Movement {
-    return reflection.isInstance(item, Movement.$type);
-}
+export function isMovement(item: unknown): item is Movement {}
 
 export type PrimaryExpression = Builtins | FunctionCall | Literal | VariableRef;

[NoCoverage] BlockStatement
src/generated/ast.ts:365:79
     $type: 'PrimaryExpression'
 } as const;
 
-export function isPrimaryExpression(item: unknown): item is PrimaryExpression {
-    return reflection.isInstance(item, PrimaryExpression.$type);
-}
+export function isPrimaryExpression(item: unknown): item is PrimaryExpression {}
 
 export interface Rightward extends Movement {

[NoCoverage] BlockStatement
src/generated/ast.ts:378:63
     expression: 'expression'
 } as const;
 
-export function isRightward(item: unknown): item is Rightward {
-    return reflection.isInstance(item, Rightward.$type);
-}
+export function isRightward(item: unknown): item is Rightward {}
 
 export interface RobotML extends langium.AstNode {

[NoCoverage] BlockStatement
src/generated/ast.ts:392:59
     functions: 'functions'
 } as const;
 
-export function isRobotML(item: unknown): item is RobotML {
-    return reflection.isInstance(item, RobotML.$type);
-}
+export function isRobotML(item: unknown): item is RobotML {}
 
 export interface Rotate extends Statement {

[NoCoverage] BlockStatement
src/generated/ast.ts:406:57
     expression: 'expression'
 } as const;
 
-export function isRotate(item: unknown): item is Rotate {
-    return reflection.isInstance(item, Rotate.$type);
-}
+export function isRotate(item: unknown): item is Rotate {}
 
 export type Sensor = 'Color' | 'Distance';

[NoCoverage] BlockStatement
src/generated/ast.ts:422:61
     expression: 'expression'
 } as const;
 
-export function isSetClock(item: unknown): item is SetClock {
-    return reflection.isInstance(item, SetClock.$type);
-}
+export function isSetClock(item: unknown): item is SetClock {}
 
 export interface SetSpeed extends Statement {

[NoCoverage] BlockStatement
src/generated/ast.ts:436:61
     expression: 'expression'
 } as const;
 
-export function isSetSpeed(item: unknown): item is SetSpeed {
-    return reflection.isInstance(item, SetSpeed.$type);
-}
+export function isSetSpeed(item: unknown): item is SetSpeed {}
 
 export interface Statement extends langium.AstNode {

[NoCoverage] BlockStatement
src/generated/ast.ts:448:63
     $type: 'Statement'
 } as const;
 
-export function isStatement(item: unknown): item is Statement {
-    return reflection.isInstance(item, Statement.$type);
-}
+export function isStatement(item: unknown): item is Statement {}
 
 export type Type = 'boolean' | 'error' | 'float' | 'integer' | 'string' | 'void';

[NoCoverage] BlockStatement
src/generated/ast.ts:466:55
     op: 'op'
 } as const;
 
-export function isUnary(item: unknown): item is Unary {
-    return reflection.isInstance(item, Unary.$type);
-}
+export function isUnary(item: unknown): item is Unary {}
 
 export type UnaryOp = '!' | '-';

[NoCoverage] BlockStatement
src/generated/ast.ts:486:67
     type: 'type'
 } as const;
 
-export function isVariableDec(item: unknown): item is VariableDec {
-    return reflection.isInstance(item, VariableDec.$type);
-}
+export function isVariableDec(item: unknown): item is VariableDec {}
 
 export interface VariableRef extends Expression {

[NoCoverage] BlockStatement
src/generated/ast.ts:501:67
     ref: 'ref'
 } as const;
 
-export function isVariableRef(item: unknown): item is VariableRef {
-    return reflection.isInstance(item, VariableRef.$type);
-}
+export function isVariableRef(item: unknown): item is VariableRef {}
 
 export type RobotMlAstType = {
