[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:31:30
 	VariableRef,
 } from "./semantics.ts";
 
-function print(text: string) {
-	process.stdout.write(text);
-}
+function print(text: string) {}
 
 export class RobotMLAstPrinterVisitor implements RobotMlVisitor {

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:36:38
 }
 
 export class RobotMLAstPrinterVisitor implements RobotMlVisitor {
-	visitArgumentDec(node: ArgumentDec) {
-		print(`${node.name} ${node.type ? ": " + node.type : ""}`);
-	}
+	visitArgumentDec(node: ArgumentDec) {}
 	visitExpression(node: Expression) {
 		print("Expression");

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:37:9
 
 export class RobotMLAstPrinterVisitor implements RobotMlVisitor {
 	visitArgumentDec(node: ArgumentDec) {
-		print(`${node.name} ${node.type ? ": " + node.type : ""}`);
+		print(``);
 	}
 	visitExpression(node: Expression) {

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:37:56
 
 export class RobotMLAstPrinterVisitor implements RobotMlVisitor {
 	visitArgumentDec(node: ArgumentDec) {
-		print(`${node.name} ${node.type ? ": " + node.type : ""}`);
+		print(`${node.name} ${node.type ? ": " + node.type : "Stryker was here!"}`);
 	}
 	visitExpression(node: Expression) {

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:39:36
 	visitArgumentDec(node: ArgumentDec) {
 		print(`${node.name} ${node.type ? ": " + node.type : ""}`);
 	}
-	visitExpression(node: Expression) {
-		print("Expression");
-	}
+	visitExpression(node: Expression) {}
 	visitFunctionCall(node: FunctionCall) {
 		throw new Error("Method visitFunctionCall() not implemented.");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:42:40
 	visitExpression(node: Expression) {
 		print("Expression");
 	}
-	visitFunctionCall(node: FunctionCall) {
-		throw new Error("Method visitFunctionCall() not implemented.");
-	}
+	visitFunctionCall(node: FunctionCall) {}
 	visitGetClock(node: GetClock) {
 		throw new Error("Method visitGetClock() not implemented.");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:45:32
 	visitFunctionCall(node: FunctionCall) {
 		throw new Error("Method visitFunctionCall() not implemented.");
 	}
-	visitGetClock(node: GetClock) {
-		throw new Error("Method visitGetClock() not implemented.");
-	}
+	visitGetClock(node: GetClock) {}
 	visitGetSensor(node: GetSensor) {
 		throw new Error("Method visitGetSensor() not implemented.");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:48:34
 	visitGetClock(node: GetClock) {
 		throw new Error("Method visitGetClock() not implemented.");
 	}
-	visitGetSensor(node: GetSensor) {
-		throw new Error("Method visitGetSensor() not implemented.");
-	}
+	visitGetSensor(node: GetSensor) {}
 	visitGetSpeed(node: GetSpeed) {
 		throw new Error("Method visitGetSpeed() not implemented.");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:51:32
 	visitGetSensor(node: GetSensor) {
 		throw new Error("Method visitGetSensor() not implemented.");
 	}
-	visitGetSpeed(node: GetSpeed) {
-		throw new Error("Method visitGetSpeed() not implemented.");
-	}
+	visitGetSpeed(node: GetSpeed) {}
 	visitLiteral(node: Literal) {
 		throw new Error("Method visitLiteral() not implemented.");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:54:30
 	visitGetSpeed(node: GetSpeed) {
 		throw new Error("Method visitGetSpeed() not implemented.");
 	}
-	visitLiteral(node: Literal) {
-		throw new Error("Method visitLiteral() not implemented.");
-	}
+	visitLiteral(node: Literal) {}
 	visitUnary(node: Unary) {
 		throw new Error("Method visitUnary() not implemented.");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:57:26
 	visitLiteral(node: Literal) {
 		throw new Error("Method visitLiteral() not implemented.");
 	}
-	visitUnary(node: Unary) {
-		throw new Error("Method visitUnary() not implemented.");
-	}
+	visitUnary(node: Unary) {}
 	visitVariableRef(node: VariableRef) {
 		throw new Error("Method visitVariableRef() not implemented.");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:60:38
 	visitUnary(node: Unary) {
 		throw new Error("Method visitUnary() not implemented.");
 	}
-	visitVariableRef(node: VariableRef) {
-		throw new Error("Method visitVariableRef() not implemented.");
-	}
+	visitVariableRef(node: VariableRef) {}
 	visitRobotML(node: RobotML) {
 		print("RobotML Program\n");

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:61:19
 		throw new Error("Method visitUnary() not implemented.");
 	}
 	visitVariableRef(node: VariableRef) {
-		throw new Error("Method visitVariableRef() not implemented.");
+		throw new Error("");
 	}
 	visitRobotML(node: RobotML) {

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:63:30
 	visitVariableRef(node: VariableRef) {
 		throw new Error("Method visitVariableRef() not implemented.");
 	}
-	visitRobotML(node: RobotML) {
-		print("RobotML Program\n");
-
-		node.functions.forEach((node) => {
-			// this.visitFunctionDeclaration(node);
-		});
-	}
+	visitRobotML(node: RobotML) {}
 	visitStatement(node: Statement) {
 		switch (node.$type) {

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:70:34
 			// this.visitFunctionDeclaration(node);
 		});
 	}
-	visitStatement(node: Statement) {
-		switch (node.$type) {
-			case "FunctionDeclaration":
-				this.visitFunctionDeclaration(
-					node as FunctionDeclaration,
-				);
-				break;
-			case "VariableDec":
-				this.visitVariableDec(node as VariableDec);
-				break;
-			case "SetSpeed":
-				this.visitSetSpeed(node as SetSpeed);
-				break;
-			case "FnReturn":
-				this.visitFnReturn(node as FnReturn);
-				break;
-
-			default:
-				throw new Error(`Undefined Statement: ${node.$type}`);
-		}
-	}
+	visitStatement(node: Statement) {}
 	visitAssignation(node: Assignation) {
 		throw new Error("Method visitAssignation() not implemented.");

[NoCoverage] ConditionalExpression
src/robot-ml-ast-printer.ts:72:4
 	}
 	visitStatement(node: Statement) {
 		switch (node.$type) {
-			case "FunctionDeclaration":
-				this.visitFunctionDeclaration(
-					node as FunctionDeclaration,
-				);
-				break;
+			case "FunctionDeclaration":
 			case "VariableDec":
 				this.visitVariableDec(node as VariableDec);

[NoCoverage] ConditionalExpression
src/robot-ml-ast-printer.ts:77:4
 					node as FunctionDeclaration,
 				);
 				break;
-			case "VariableDec":
-				this.visitVariableDec(node as VariableDec);
-				break;
+			case "VariableDec":
 			case "SetSpeed":
 				this.visitSetSpeed(node as SetSpeed);

[NoCoverage] ConditionalExpression
src/robot-ml-ast-printer.ts:80:4
 			case "VariableDec":
 				this.visitVariableDec(node as VariableDec);
 				break;
-			case "SetSpeed":
-				this.visitSetSpeed(node as SetSpeed);
-				break;
+			case "SetSpeed":
 			case "FnReturn":
 				this.visitFnReturn(node as FnReturn);

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:80:9
 			case "VariableDec":
 				this.visitVariableDec(node as VariableDec);
 				break;
-			case "SetSpeed":
+			case "":
 				this.visitSetSpeed(node as SetSpeed);
 				break;

[NoCoverage] ConditionalExpression
src/robot-ml-ast-printer.ts:83:4
 			case "SetSpeed":
 				this.visitSetSpeed(node as SetSpeed);
 				break;
-			case "FnReturn":
-				this.visitFnReturn(node as FnReturn);
-				break;
+			case "FnReturn":
 
 			default:

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:83:9
 			case "SetSpeed":
 				this.visitSetSpeed(node as SetSpeed);
 				break;
-			case "FnReturn":
+			case "":
 				this.visitFnReturn(node as FnReturn);
 				break;

[NoCoverage] ConditionalExpression
src/robot-ml-ast-printer.ts:87:4
 				this.visitFnReturn(node as FnReturn);
 				break;
 
-			default:
-				throw new Error(`Undefined Statement: ${node.$type}`);
+			default:
 		}
 	}

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:88:21
 				break;
 
 			default:
-				throw new Error(`Undefined Statement: ${node.$type}`);
+				throw new Error(``);
 		}
 	}

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:91:38
 				throw new Error(`Undefined Statement: ${node.$type}`);
 		}
 	}
-	visitAssignation(node: Assignation) {
-		throw new Error("Method visitAssignation() not implemented.");
-	}
+	visitAssignation(node: Assignation) {}
 	visitBlock(node: Block) {
 		print("{\n");

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:92:19
 		}
 	}
 	visitAssignation(node: Assignation) {
-		throw new Error("Method visitAssignation() not implemented.");
+		throw new Error("");
 	}
 	visitBlock(node: Block) {

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:94:26
 	visitAssignation(node: Assignation) {
 		throw new Error("Method visitAssignation() not implemented.");
 	}
-	visitBlock(node: Block) {
-		print("{\n");
-
-		node.statements.forEach((p) => {
-			this.visitStatement(p);
-		});
-
-		print("\n}\n");
-	}
+	visitBlock(node: Block) {}
 	visitCondition(node: Condition) {
 		throw new Error("Method visitCondition() not implemented.");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:97:34
 	visitBlock(node: Block) {
 		print("{\n");
 
-		node.statements.forEach((p) => {
-			this.visitStatement(p);
-		});
+		node.statements.forEach((p) => {});
 
 		print("\n}\n");

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:101:9
 			this.visitStatement(p);
 		});
 
-		print("\n}\n");
+		print("");
 	}
 	visitCondition(node: Condition) {

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:103:34
 
 		print("\n}\n");
 	}
-	visitCondition(node: Condition) {
-		throw new Error("Method visitCondition() not implemented.");
-	}
+	visitCondition(node: Condition) {}
 	visitFnReturn(node: FnReturn) {
 		print("return ");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:106:32
 	visitCondition(node: Condition) {
 		throw new Error("Method visitCondition() not implemented.");
 	}
-	visitFnReturn(node: FnReturn) {
-		print("return ");
-		this.visitExpression(node.expression);
-	}
+	visitFnReturn(node: FnReturn) {}
 	visitFunctionDeclaration(node: FunctionDeclaration) {
 		print("FunctionDecl(");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:110:54
 		print("return ");
 		this.visitExpression(node.expression);
 	}
-	visitFunctionDeclaration(node: FunctionDeclaration) {
-		print("FunctionDecl(");
-
-		node.parameters.forEach((p) => {
-			this.visitArgumentDec(p);
-			print(",");
-		});
-
-		print(") ");
-
-		this.visitBlock(node.block);
-	}
+	visitFunctionDeclaration(node: FunctionDeclaration) {}
 	visitLoop(node: Loop) {
 		throw new Error("Method visitLoop() not implemented.");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:113:34
 	visitFunctionDeclaration(node: FunctionDeclaration) {
 		print("FunctionDecl(");
 
-		node.parameters.forEach((p) => {
-			this.visitArgumentDec(p);
-			print(",");
-		});
+		node.parameters.forEach((p) => {});
 
 		print(") ");

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:118:9
 			print(",");
 		});
 
-		print(") ");
+		print("");
 
 		this.visitBlock(node.block);

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:122:24
 
 		this.visitBlock(node.block);
 	}
-	visitLoop(node: Loop) {
-		throw new Error("Method visitLoop() not implemented.");
-	}
+	visitLoop(node: Loop) {}
 	visitMovement(node: Movement) {
 		throw new Error("Method visitMovement() not implemented.");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:125:32
 	visitLoop(node: Loop) {
 		throw new Error("Method visitLoop() not implemented.");
 	}
-	visitMovement(node: Movement) {
-		throw new Error("Method visitMovement() not implemented.");
-	}
+	visitMovement(node: Movement) {}
 	visitBackward(node: Backward) {
 		throw new Error("Method visitBackward() not implemented.");

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:126:19
 		throw new Error("Method visitLoop() not implemented.");
 	}
 	visitMovement(node: Movement) {
-		throw new Error("Method visitMovement() not implemented.");
+		throw new Error("");
 	}
 	visitBackward(node: Backward) {

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:128:32
 	visitMovement(node: Movement) {
 		throw new Error("Method visitMovement() not implemented.");
 	}
-	visitBackward(node: Backward) {
-		throw new Error("Method visitBackward() not implemented.");
-	}
+	visitBackward(node: Backward) {}
 	visitForward(node: Forward) {
 		throw new Error("Method visitForward() not implemented.");

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:129:19
 		throw new Error("Method visitMovement() not implemented.");
 	}
 	visitBackward(node: Backward) {
-		throw new Error("Method visitBackward() not implemented.");
+		throw new Error("");
 	}
 	visitForward(node: Forward) {

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:131:30
 	visitBackward(node: Backward) {
 		throw new Error("Method visitBackward() not implemented.");
 	}
-	visitForward(node: Forward) {
-		throw new Error("Method visitForward() not implemented.");
-	}
+	visitForward(node: Forward) {}
 	visitLeftward(node: Leftward) {
 		throw new Error("Method visitLeftward() not implemented.");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:134:32
 	visitForward(node: Forward) {
 		throw new Error("Method visitForward() not implemented.");
 	}
-	visitLeftward(node: Leftward) {
-		throw new Error("Method visitLeftward() not implemented.");
-	}
+	visitLeftward(node: Leftward) {}
 	visitRightward(node: Rightward) {
 		throw new Error("Method visitRightward() not implemented.");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:137:34
 	visitLeftward(node: Leftward) {
 		throw new Error("Method visitLeftward() not implemented.");
 	}
-	visitRightward(node: Rightward) {
-		throw new Error("Method visitRightward() not implemented.");
-	}
+	visitRightward(node: Rightward) {}
 	visitRotate(node: Rotate) {
 		throw new Error("Method visitRotate() not implemented.");

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:138:19
 		throw new Error("Method visitLeftward() not implemented.");
 	}
 	visitRightward(node: Rightward) {
-		throw new Error("Method visitRightward() not implemented.");
+		throw new Error("");
 	}
 	visitRotate(node: Rotate) {

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:140:28
 	visitRightward(node: Rightward) {
 		throw new Error("Method visitRightward() not implemented.");
 	}
-	visitRotate(node: Rotate) {
-		throw new Error("Method visitRotate() not implemented.");
-	}
+	visitRotate(node: Rotate) {}
 	visitSetClock(node: SetClock) {
 		throw new Error("Method visitSetClock() not implemented.");

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:141:19
 		throw new Error("Method visitRightward() not implemented.");
 	}
 	visitRotate(node: Rotate) {
-		throw new Error("Method visitRotate() not implemented.");
+		throw new Error("");
 	}
 	visitSetClock(node: SetClock) {

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:143:32
 	visitRotate(node: Rotate) {
 		throw new Error("Method visitRotate() not implemented.");
 	}
-	visitSetClock(node: SetClock) {
-		throw new Error("Method visitSetClock() not implemented.");
-	}
+	visitSetClock(node: SetClock) {}
 	visitSetSpeed(node: SetSpeed) {
 		print("visitSetSpeed\n");

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:146:32
 	visitSetClock(node: SetClock) {
 		throw new Error("Method visitSetClock() not implemented.");
 	}
-	visitSetSpeed(node: SetSpeed) {
-		print("visitSetSpeed\n");
-	}
+	visitSetSpeed(node: SetSpeed) {}
 	visitVariableDec(node: VariableDec) {
 		print(`visitVariableDec(${node.name})\n`);

[NoCoverage] StringLiteral
src/robot-ml-ast-printer.ts:147:9
 		throw new Error("Method visitSetClock() not implemented.");
 	}
 	visitSetSpeed(node: SetSpeed) {
-		print("visitSetSpeed\n");
+		print("");
 	}
 	visitVariableDec(node: VariableDec) {

[NoCoverage] BlockStatement
src/robot-ml-ast-printer.ts:149:38
 	visitSetSpeed(node: SetSpeed) {
 		print("visitSetSpeed\n");
 	}
-	visitVariableDec(node: VariableDec) {
-		print(`visitVariableDec(${node.name})\n`);
-	}
+	visitVariableDec(node: VariableDec) {}
 }
 
