[Killed] BlockStatement
src/robot-ml-typecheck.ts:38:38
 	type: Type;
 }
 
-function isFloat(n: number): boolean {
-	console.trace(n, Number(n) === n && n % 1 !== 0);
-	return Number(n) === n && n % 1 !== 0;
-	// function isFloat(n) {
-	// return !Number.isInteger(n);
-}
+function isFloat(n: number): boolean {}
 
 export class RobotMLTypeCheckVisitor extends RobotMlValidationVisitor {
killedBy: Parsing tests Authorized additions
statusReason: expected 3 to equal +0

[Survived] EqualityOperator
src/robot-ml-typecheck.ts:39:19
 }
 
 function isFloat(n: number): boolean {
-	console.trace(n, Number(n) === n && n % 1 !== 0);
+	console.trace(n, Number(n) !== n && n % 1 !== 0);
 	return Number(n) === n && n % 1 !== 0;
 	// function isFloat(n) {

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:39:19
 }
 
 function isFloat(n: number): boolean {
-	console.trace(n, Number(n) === n && n % 1 !== 0);
+	console.trace(n, true);
 	return Number(n) === n && n % 1 !== 0;
 	// function isFloat(n) {

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:40:9
 
 function isFloat(n: number): boolean {
 	console.trace(n, Number(n) === n && n % 1 !== 0);
-	return Number(n) === n && n % 1 !== 0;
+	return true;
 	// function isFloat(n) {
 	// return !Number.isInteger(n);
killedBy: Parsing tests Authorized additions
statusReason: expected 1 to equal +0

[Killed] ArithmeticOperator
src/robot-ml-typecheck.ts:40:28
 
 function isFloat(n: number): boolean {
 	console.trace(n, Number(n) === n && n % 1 !== 0);
-	return Number(n) === n && n % 1 !== 0;
+	return Number(n) === n && n * 1 !== 0;
 	// function isFloat(n) {
 	// return !Number.isInteger(n);
killedBy: Parsing tests Authorized additions
statusReason: expected 1 to equal +0

[Killed] BlockStatement
src/robot-ml-typecheck.ts:48:16
 export class RobotMLTypeCheckVisitor extends RobotMlValidationVisitor {
 	symbolTable: SymbolTable;
 
-	constructor() {
-		super();
-		this.symbolTable = new SymbolTable();
-	}
+	constructor() {}
 	visitArgumentDec(node: ArgumentDec) {
 		this.symbolTable.put(node.name, node.type, { node: node });
killedBy: Parsing tests should fail on empty input
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/robot-ml-typecheck.ts:52:38
 		super();
 		this.symbolTable = new SymbolTable();
 	}
-	visitArgumentDec(node: ArgumentDec) {
-		this.symbolTable.put(node.name, node.type, { node: node });
-	}
+	visitArgumentDec(node: ArgumentDec) {}
 	visitExpression(node: Expression): Value {
 		switch (node.$type) {
killedBy: Parsing tests controlflow
statusReason: expected 3 to equal +0

[Survived] ObjectLiteral
src/robot-ml-typecheck.ts:53:46
 		this.symbolTable = new SymbolTable();
 	}
 	visitArgumentDec(node: ArgumentDec) {
-		this.symbolTable.put(node.name, node.type, { node: node });
+		this.symbolTable.put(node.name, node.type, {});
 	}
 	visitExpression(node: Expression): Value {

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:63:6
 				switch (node2.operator) {
 					// bool only
 					case "&&":
-					case "||": {
-						const { type: typeL } =
-							this.visitExpression(
-								node2.left as unknown as Expression,
-							);
-						const { type: typeR } =
-							this.visitExpression(
-								node2.right as unknown as Expression,
-							);
-						if (
-							typeL !== typeR ||
-							typeL !== "boolean"
-						) {
-							this.validationAccept(
-								"error",
-								`Cound not apply a boolean operation between a ${typeL} and ${typeR} a ${node}`,
-								{
-									node: node,
-								},
-							);
-							throw "Error";
-						}
-						return { type: "boolean" };
-					}
+					case "||":
+
+// t1 == t1 or int == float or float == int
 
 					// t1 == t1 or int == float or float == int

[Survived] BlockStatement
src/robot-ml-typecheck.ts:63:17
 				switch (node2.operator) {
 					// bool only
 					case "&&":
-					case "||": {
-						const { type: typeL } =
-							this.visitExpression(
-								node2.left as unknown as Expression,
-							);
-						const { type: typeR } =
-							this.visitExpression(
-								node2.right as unknown as Expression,
-							);
-						if (
-							typeL !== typeR ||
-							typeL !== "boolean"
-						) {
-							this.validationAccept(
-								"error",
-								`Cound not apply a boolean operation between a ${typeL} and ${typeR} a ${node}`,
-								{
-									node: node,
-								},
-							);
-							throw "Error";
-						}
-						return { type: "boolean" };
-					}
+					case "||": {}
 
 					// t1 == t1 or int == float or float == int

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:73:8
 								node2.right as unknown as Expression,
 							);
 						if (
-							typeL !== typeR ||
-							typeL !== "boolean"
+							true
 						) {
 							this.validationAccept(
killedBy: Parsing tests math
statusReason: expected 3 to equal +0

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:73:8
 								node2.right as unknown as Expression,
 							);
 						if (
-							typeL !== typeR ||
+							typeL === typeR ||
 							typeL !== "boolean"
 						) {
killedBy: Parsing tests math
statusReason: expected 3 to equal +0

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:74:8
 							);
 						if (
 							typeL !== typeR ||
-							typeL !== "boolean"
+							typeL === "boolean"
 						) {
 							this.validationAccept(
killedBy: Parsing tests math
statusReason: expected 3 to equal +0

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:74:8
 							);
 						if (
 							typeL !== typeR ||
-							typeL !== "boolean"
+							false
 						) {
 							this.validationAccept(

[NoCoverage] BlockStatement
src/robot-ml-typecheck.ts:75:9
 						if (
 							typeL !== typeR ||
 							typeL !== "boolean"
-						) {
-							this.validationAccept(
-								"error",
-								`Cound not apply a boolean operation between a ${typeL} and ${typeR} a ${node}`,
-								{
-									node: node,
-								},
-							);
-							throw "Error";
-						}
+						) {}
 						return { type: "boolean" };
 					}

[NoCoverage] StringLiteral
src/robot-ml-typecheck.ts:78:9
 						) {
 							this.validationAccept(
 								"error",
-								`Cound not apply a boolean operation between a ${typeL} and ${typeR} a ${node}`,
+								``,
 								{
 									node: node,

[Survived] StringLiteral
src/robot-ml-typecheck.ts:90:11
 
 					// t1 == t1 or int == float or float == int
 					case "!=":
-					case "==": {
+					case "": {
 						const { type: typeL } =
 							this.visitExpression(

[Survived] LogicalOperator
src/robot-ml-typecheck.ts:101:8
 							);
 
 						const checkNumber =
-							(typeL === "float" &&
-								typeR === "integer") ||
-							(typeL === "integer" &&
-								typeR === "float");
+							typeL === "float" && typeR === "integer" && typeL === "integer" && typeR === "float";
 
 						if (

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:101:9
 							);
 
 						const checkNumber =
-							(typeL === "float" &&
-								typeR === "integer") ||
+							(false) ||
 							(typeL === "integer" &&
 								typeR === "float");

[NoCoverage] EqualityOperator
src/robot-ml-typecheck.ts:102:9
 
 						const checkNumber =
 							(typeL === "float" &&
-								typeR === "integer") ||
+								typeR !== "integer") ||
 							(typeL === "integer" &&
 								typeR === "float");

[NoCoverage] ConditionalExpression
src/robot-ml-typecheck.ts:102:9
 
 						const checkNumber =
 							(typeL === "float" &&
-								typeR === "integer") ||
+								true) ||
 							(typeL === "integer" &&
 								typeR === "float");

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:103:9
 						const checkNumber =
 							(typeL === "float" &&
 								typeR === "integer") ||
-							(typeL === "integer" &&
+							(true &&
 								typeR === "float");
 

[Survived] LogicalOperator
src/robot-ml-typecheck.ts:103:9
 						const checkNumber =
 							(typeL === "float" &&
 								typeR === "integer") ||
-							(typeL === "integer" &&
-								typeR === "float");
+							(typeL === "integer" || typeR === "float");
 
 						if (

[Survived] EqualityOperator
src/robot-ml-typecheck.ts:104:9
 							(typeL === "float" &&
 								typeR === "integer") ||
 							(typeL === "integer" &&
-								typeR === "float");
+								typeR !== "float");
 
 						if (

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:104:9
 							(typeL === "float" &&
 								typeR === "integer") ||
 							(typeL === "integer" &&
-								typeR === "float");
+								true);
 
 						if (

[Killed] BooleanLiteral
src/robot-ml-typecheck.ts:107:8
 								typeR === "float");
 
 						if (
-							!(
-								typeL === typeR &&
-								typeL !== "void"
-							) &&
+							typeL === typeR && typeL !== "void" &&
 							!checkNumber
 						) {
killedBy: Parsing tests controlflow
statusReason: expected 1 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:107:8
 								typeR === "float");
 
 						if (
-							!(
-								typeL === typeR &&
-								typeL !== "void"
-							) &&
-							!checkNumber
+							true
 						) {
 							this.validationAccept(
killedBy: Parsing tests controlflow
statusReason: expected 1 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:108:9
 
 						if (
 							!(
-								typeL === typeR &&
-								typeL !== "void"
+								false
 							) &&
 							!checkNumber
killedBy: Parsing tests controlflow
statusReason: expected 1 to equal +0

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:108:9
 
 						if (
 							!(
-								typeL === typeR &&
+								typeL !== typeR &&
 								typeL !== "void"
 							) &&
killedBy: Parsing tests controlflow
statusReason: expected 1 to equal +0

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:109:9
 						if (
 							!(
 								typeL === typeR &&
-								typeL !== "void"
+								typeL === "void"
 							) &&
 							!checkNumber
killedBy: Parsing tests controlflow
statusReason: expected 1 to equal +0

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:109:9
 						if (
 							!(
 								typeL === typeR &&
-								typeL !== "void"
+								true
 							) &&
 							!checkNumber

[NoCoverage] BooleanLiteral
src/robot-ml-typecheck.ts:111:8
 								typeL === typeR &&
 								typeL !== "void"
 							) &&
-							!checkNumber
+							checkNumber
 						) {
 							this.validationAccept(

[NoCoverage] BlockStatement
src/robot-ml-typecheck.ts:112:9
 								typeL !== "void"
 							) &&
 							!checkNumber
-						) {
-							this.validationAccept(
-								"error",
-								`Cound not check the equality between a ${typeL} and a ${typeR} ${node}`,
-								{
-									node: node,
-								},
-							);
-							throw "Error";
-						}
+						) {}
 						return { type: "boolean" };
 					}

[Killed] StringLiteral
src/robot-ml-typecheck.ts:127:11
 
 					// (t1 == t1 and t1 != bool and t1 != t1) or int + float or float + int
 
-					case "+": {
+					case "": {
 						const { type: typeL } =
 							this.visitExpression(
killedBy: Parsing tests Add a int to a bool
statusReason: expected +0 to equal 5

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:138:9
 							);
 
 						const checkNumber =
-							(typeL === "float" &&
+							(true &&
 								typeR === "integer") ||
 							(typeL === "integer" &&
killedBy: Parsing tests Authorized additions
statusReason: expected 1 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:138:8
 							);
 
 						const checkNumber =
-							(typeL === "float" &&
-								typeR === "integer") ||
-							(typeL === "integer" &&
-								typeR === "float");
+							true;
 
 						if (
killedBy: Parsing tests Authorized additions
statusReason: expected 2 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:140:9
 						const checkNumber =
 							(typeL === "float" &&
 								typeR === "integer") ||
-							(typeL === "integer" &&
-								typeR === "float");
+							(false);
 
 						if (
killedBy: Parsing tests Authorized additions
statusReason: expected 1 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:144:8
 								typeR === "float");
 
 						if (
-							!(
-								typeL === typeR &&
-								typeL !== "boolean" &&
-								typeL !== "void"
-							) &&
-							!checkNumber
+							true
 						) {
 							this.validationAccept(
killedBy: Parsing tests Authorized additions
statusReason: expected 15 to equal +0

[Killed] LogicalOperator
src/robot-ml-typecheck.ts:144:8
 								typeR === "float");
 
 						if (
-							!(
-								typeL === typeR &&
-								typeL !== "boolean" &&
-								typeL !== "void"
-							) &&
-							!checkNumber
+							!(typeL === typeR && typeL !== "boolean" && typeL !== "void") || !checkNumber
 						) {
 							this.validationAccept(
killedBy: Parsing tests Authorized additions
statusReason: expected 15 to equal +0

[Killed] LogicalOperator
src/robot-ml-typecheck.ts:145:9
 
 						if (
 							!(
-								typeL === typeR &&
-								typeL !== "boolean" &&
+								typeL === typeR || typeL !== "boolean" &&
 								typeL !== "void"
 							) &&
killedBy: Parsing tests Add a int to a bool
statusReason: expected 4 to equal 5

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:145:9
 
 						if (
 							!(
-								typeL === typeR &&
-								typeL !== "boolean" &&
-								typeL !== "void"
+								false
 							) &&
 							!checkNumber
killedBy: Parsing tests Authorized additions
statusReason: expected 13 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:146:9
 						if (
 							!(
 								typeL === typeR &&
-								typeL !== "boolean" &&
+								true &&
 								typeL !== "void"
 							) &&
killedBy: Parsing tests Add a int to a bool
statusReason: expected 4 to equal 5

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:146:9
 						if (
 							!(
 								typeL === typeR &&
-								typeL !== "boolean" &&
+								typeL === "boolean" &&
 								typeL !== "void"
 							) &&
killedBy: Parsing tests Authorized additions
statusReason: expected 13 to equal +0

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:147:9
 							!(
 								typeL === typeR &&
 								typeL !== "boolean" &&
-								typeL !== "void"
+								typeL === "void"
 							) &&
 							!checkNumber
killedBy: Parsing tests Authorized additions
statusReason: expected 13 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:147:9
 							!(
 								typeL === typeR &&
 								typeL !== "boolean" &&
-								typeL !== "void"
+								true
 							) &&
 							!checkNumber
killedBy: Parsing tests Add a int to a bool
statusReason: expected 4 to equal 5

[Killed] BlockStatement
src/robot-ml-typecheck.ts:150:9
 								typeL !== "void"
 							) &&
 							!checkNumber
-						) {
-							this.validationAccept(
-								"error",
-								`Could not add a ${typeL} to a ${typeR} ${node}`,
-								{
-									node: node,
-								},
-							);
-							throw "Error";
-						}
+						) {}
 
 						if (checkNumber) {
killedBy: Parsing tests Add a int to a bool
statusReason: expected 1 to equal 5

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:161:11
 							throw "Error";
 						}
 
-						if (checkNumber) {
+						if (true) {
 							return { type: "float" };
 						} else {
killedBy: Parsing tests Authorized additions
statusReason: expected 2 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:161:11
 							throw "Error";
 						}
 
-						if (checkNumber) {
+						if (false) {
 							return { type: "float" };
 						} else {
killedBy: Parsing tests Authorized additions
statusReason: expected 2 to equal +0

[Killed] StringLiteral
src/robot-ml-typecheck.ts:162:23
 						}
 
 						if (checkNumber) {
-							return { type: "float" };
+							return { type: "" };
 						} else {
 							return { type: typeR };
killedBy: Parsing tests Authorized additions
statusReason: expected 3 to equal +0

[Killed] BlockStatement
src/robot-ml-typecheck.ts:163:14
 
 						if (checkNumber) {
 							return { type: "float" };
-						} else {
-							return { type: typeR };
-						}
+						} else {}
 					}
 
killedBy: Parsing tests Authorized additions
statusReason: expected 1 to equal +0

[Killed] StringLiteral
src/robot-ml-typecheck.ts:170:11
 
 					case "*":
 					case "-":
-					case "/":
+					case "":
 					case "^": {
 						const { type: typeL } =
killedBy: Parsing tests math
statusReason: expected 39 to equal +0

[Survived] StringLiteral
src/robot-ml-typecheck.ts:171:11
 					case "*":
 					case "-":
 					case "/":
-					case "^": {
+					case "": {
 						const { type: typeL } =
 							this.visitExpression(

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:182:9
 							);
 
 						const checkNumber1 =
-							(typeL === "float" &&
+							(typeL !== "float" &&
 								typeR === "integer") ||
 							(typeL === "integer" &&
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 12 to equal +0

[Killed] LogicalOperator
src/robot-ml-typecheck.ts:182:8
 							);
 
 						const checkNumber1 =
-							(typeL === "float" &&
-								typeR === "integer") ||
-							(typeL === "integer" &&
-								typeR === "float");
+							typeL === "float" && typeR === "integer" && typeL === "integer" && typeR === "float";
 
 						const checkNumber2 =
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 12 to equal +0

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:184:9
 						const checkNumber1 =
 							(typeL === "float" &&
 								typeR === "integer") ||
-							(typeL === "integer" &&
+							(typeL !== "integer" &&
 								typeR === "float");
 
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 4 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:188:9
 								typeR === "float");
 
 						const checkNumber2 =
-							(typeL === "float" &&
-								typeR === "float") ||
+							(false) ||
 							(typeL === "integer" &&
 								typeR === "integer");
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 36 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:188:8
 								typeR === "float");
 
 						const checkNumber2 =
-							(typeL === "float" &&
-								typeR === "float") ||
-							(typeL === "integer" &&
-								typeR === "integer");
+							false;
 
 						if (!checkNumber1 && !checkNumber2) {
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 48 to equal +0

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:189:9
 
 						const checkNumber2 =
 							(typeL === "float" &&
-								typeR === "float") ||
+								typeR !== "float") ||
 							(typeL === "integer" &&
 								typeR === "integer");
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 36 to equal +0

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:189:9
 
 						const checkNumber2 =
 							(typeL === "float" &&
-								typeR === "float") ||
+								true) ||
 							(typeL === "integer" &&
 								typeR === "integer");

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:190:9
 						const checkNumber2 =
 							(typeL === "float" &&
 								typeR === "float") ||
-							(typeL === "integer" &&
-								typeR === "integer");
+							(false);
 
 						if (!checkNumber1 && !checkNumber2) {
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 16 to equal +0

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:190:9
 						const checkNumber2 =
 							(typeL === "float" &&
 								typeR === "float") ||
-							(typeL === "integer" &&
+							(typeL !== "integer" &&
 								typeR === "integer");
 
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 16 to equal +0

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:191:9
 							(typeL === "float" &&
 								typeR === "float") ||
 							(typeL === "integer" &&
-								typeR === "integer");
+								typeR !== "integer");
 
 						if (!checkNumber1 && !checkNumber2) {
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 16 to equal +0

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:191:9
 							(typeL === "float" &&
 								typeR === "float") ||
 							(typeL === "integer" &&
-								typeR === "integer");
+								true);
 
 						if (!checkNumber1 && !checkNumber2) {

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:193:11
 							(typeL === "integer" &&
 								typeR === "integer");
 
-						if (!checkNumber1 && !checkNumber2) {
+						if (true) {
 							this.validationAccept(
 								"error",
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 56 to equal +0

[Killed] BooleanLiteral
src/robot-ml-typecheck.ts:193:28
 							(typeL === "integer" &&
 								typeR === "integer");
 
-						if (!checkNumber1 && !checkNumber2) {
+						if (!checkNumber1 && checkNumber2) {
 							this.validationAccept(
 								"error",
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 48 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:204:11
 							throw "Error";
 						}
 
-						if (checkNumber1) {
+						if (false) {
 							return { type: "float" };
 						} else {
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 8 to equal +0

[Killed] BlockStatement
src/robot-ml-typecheck.ts:204:25
 							throw "Error";
 						}
 
-						if (checkNumber1) {
-							return { type: "float" };
-						} else {
+						if (checkNumber1) {} else {
 							return { type: typeR };
 						}
killedBy: Parsing tests Authorized arithmetic operations
statusReason: expected 12 to equal +0

[Survived] StringLiteral
src/robot-ml-typecheck.ts:212:11
 					}
 
 					case "<":
-					case "<=":
+					case "":
 					case ">":
 					case ">=": {

[Survived] StringLiteral
src/robot-ml-typecheck.ts:214:11
 					case "<":
 					case "<=":
 					case ">":
-					case ">=": {
+					case "": {
 						const { type: typeL } =
 							this.visitExpression(

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:225:8
 							);
 
 						const checkNumber1 =
-							(typeL === "float" &&
-								typeR === "integer") ||
-							(typeL === "integer" &&
-								typeR === "float");
+							true;
 
 						const checkNumber2 =

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:225:9
 							);
 
 						const checkNumber1 =
-							(typeL === "float" &&
-								typeR === "integer") ||
+							(false) ||
 							(typeL === "integer" &&
 								typeR === "float");

[Killed] LogicalOperator
src/robot-ml-typecheck.ts:231:8
 								typeR === "float");
 
 						const checkNumber2 =
-							(typeL === "float" &&
-								typeR === "float") ||
-							(typeL === "integer" &&
-								typeR === "integer");
+							typeL === "float" && typeR === "float" && typeL === "integer" && typeR === "integer";
 
 						if (!checkNumber1 && !checkNumber2) {
killedBy: Parsing tests controlflow
statusReason: expected 1 to equal +0

[NoCoverage] StringLiteral
src/robot-ml-typecheck.ts:239:9
 						if (!checkNumber1 && !checkNumber2) {
 							this.validationAccept(
 								"error",
-								`Cound not apply the operation ${node2.operator} between a ${typeL} and a ${typeR} ${node}`,
+								``,
 								{
 									node: node,

[NoCoverage] ConditionalExpression
src/robot-ml-typecheck.ts:251:4
 				}
 				return;
 			}
-			case "Expression":
-				return this.visitExpression(node as Expression);
+			case "Expression":
 			case "FunctionCall":
 				return this.visitFunctionCall(node as FunctionCall);

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:253:4
 			}
 			case "Expression":
 				return this.visitExpression(node as Expression);
-			case "FunctionCall":
-				return this.visitFunctionCall(node as FunctionCall);
+			case "FunctionCall":
 			case "GetClock":
 				return this.visitGetClock(node as GetClock);
killedBy: Parsing tests function
statusReason: expected 2 to equal +0

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:255:4
 				return this.visitExpression(node as Expression);
 			case "FunctionCall":
 				return this.visitFunctionCall(node as FunctionCall);
-			case "GetClock":
-				return this.visitGetClock(node as GetClock);
+			case "GetClock":
 			case "GetSensor":
 				return this.visitGetSensor(node as GetSensor);

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:257:4
 				return this.visitFunctionCall(node as FunctionCall);
 			case "GetClock":
 				return this.visitGetClock(node as GetClock);
-			case "GetSensor":
-				return this.visitGetSensor(node as GetSensor);
+			case "GetSensor":
 			case "GetSpeed":
 				return this.visitGetSpeed(node as GetSpeed);

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:259:4
 				return this.visitGetClock(node as GetClock);
 			case "GetSensor":
 				return this.visitGetSensor(node as GetSensor);
-			case "GetSpeed":
-				return this.visitGetSpeed(node as GetSpeed);
+			case "GetSpeed":
 			case "Literal":
 				return this.visitLiteral(node as Literal);
killedBy: Parsing tests builtins
statusReason: expected 3 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:261:4
 				return this.visitGetSensor(node as GetSensor);
 			case "GetSpeed":
 				return this.visitGetSpeed(node as GetSpeed);
-			case "Literal":
-				return this.visitLiteral(node as Literal);
+			case "Literal":
 			case "Unary":
 				return this.visitUnary(node as Unary);
killedBy: Parsing tests builtins
statusReason: expected 44 to equal +0

[Killed] StringLiteral
src/robot-ml-typecheck.ts:261:9
 				return this.visitGetSensor(node as GetSensor);
 			case "GetSpeed":
 				return this.visitGetSpeed(node as GetSpeed);
-			case "Literal":
+			case "":
 				return this.visitLiteral(node as Literal);
 			case "Unary":
killedBy: Parsing tests builtins
statusReason: expected 44 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:263:4
 				return this.visitGetSpeed(node as GetSpeed);
 			case "Literal":
 				return this.visitLiteral(node as Literal);
-			case "Unary":
-				return this.visitUnary(node as Unary);
+			case "Unary":
 			case "VariableRef":
 				return this.visitVariableRef(node as VariableRef);
killedBy: Parsing tests builtinsErr
statusReason: expected 10 to equal 12

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:265:4
 				return this.visitLiteral(node as Literal);
 			case "Unary":
 				return this.visitUnary(node as Unary);
-			case "VariableRef":
-				return this.visitVariableRef(node as VariableRef);
+			case "VariableRef":
 		}
 	}
killedBy: Parsing tests builtinsErr
statusReason: expected 3 to equal 12

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:271:7
 	}
 	visitFunctionCall(node: FunctionCall): Value {
 		const name = node.functiondeclaration.ref.name;
-		if (!this.symbolTable.inScope(name)) {
+		if (true) {
 			this.validationAccept(
 				"error",
killedBy: Parsing tests function
statusReason: expected 2 to equal +0

[Killed] BooleanLiteral
src/robot-ml-typecheck.ts:271:7
 	}
 	visitFunctionCall(node: FunctionCall): Value {
 		const name = node.functiondeclaration.ref.name;
-		if (!this.symbolTable.inScope(name)) {
+		if (this.symbolTable.inScope(name)) {
 			this.validationAccept(
 				"error",
killedBy: Parsing tests function
statusReason: expected 2 to equal +0

[NoCoverage] BlockStatement
src/robot-ml-typecheck.ts:281:34
 			);
 		}
 
-		node.parameters.forEach((e) => {
-			// TODO do check on function arguments <=> parameters expression
-			this.visitExpression(e);
-		});
+		node.parameters.forEach((e) => {});
 
 		const type = this.symbolTable.type(name);

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:288:7
 
 		const type = this.symbolTable.type(name);
 
-		if (!type) {
+		if (true) {
 			this.validationAccept(
 				"warning",
killedBy: Parsing tests function
statusReason: expected 2 to equal +0

[Killed] BooleanLiteral
src/robot-ml-typecheck.ts:288:7
 
 		const type = this.symbolTable.type(name);
 
-		if (!type) {
+		if (type) {
 			this.validationAccept(
 				"warning",
killedBy: Parsing tests function
statusReason: expected 2 to equal +0

[Killed] LogicalOperator
src/robot-ml-typecheck.ts:298:18
 			);
 		}
 
-		return { type: type ?? "void" };
+		return { type: type && "void" };
 	}
 	visitGetClock(_node: GetClock): Value {
killedBy: Parsing tests function
statusReason: expected 2 to equal +0

[Killed] ObjectLiteral
src/robot-ml-typecheck.ts:298:10
 			);
 		}
 
-		return { type: type ?? "void" };
+		return {};
 	}
 	visitGetClock(_node: GetClock): Value {
killedBy: Parsing tests function
statusReason: expected 2 to equal +0

[Killed] BlockStatement
src/robot-ml-typecheck.ts:300:40
 
 		return { type: type ?? "void" };
 	}
-	visitGetClock(_node: GetClock): Value {
-		return { type: "integer" };
-	}
+	visitGetClock(_node: GetClock): Value {}
 	visitGetSensor(_node: GetSensor): Value {
 		return { type: "float" };
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Survived] StringLiteral
src/robot-ml-typecheck.ts:301:18
 		return { type: type ?? "void" };
 	}
 	visitGetClock(_node: GetClock): Value {
-		return { type: "integer" };
+		return { type: "" };
 	}
 	visitGetSensor(_node: GetSensor): Value {

[Killed] BlockStatement
src/robot-ml-typecheck.ts:303:42
 	visitGetClock(_node: GetClock): Value {
 		return { type: "integer" };
 	}
-	visitGetSensor(_node: GetSensor): Value {
-		return { type: "float" };
-	}
+	visitGetSensor(_node: GetSensor): Value {}
 	visitGetSpeed(_node: GetSpeed): Value {
 		return { type: "float" };
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12
