[Survived] StringLiteral
src/robot-ml-typecheck.ts:304:18
 		return { type: "integer" };
 	}
 	visitGetSensor(_node: GetSensor): Value {
-		return { type: "float" };
+		return { type: "" };
 	}
 	visitGetSpeed(_node: GetSpeed): Value {

[Killed] BlockStatement
src/robot-ml-typecheck.ts:306:40
 	visitGetSensor(_node: GetSensor): Value {
 		return { type: "float" };
 	}
-	visitGetSpeed(_node: GetSpeed): Value {
-		return { type: "float" };
-	}
+	visitGetSpeed(_node: GetSpeed): Value {}
 	visitLiteral(node: Literal): Value {
 		switch (typeof node.value) {
killedBy: Parsing tests builtins
statusReason: expected 3 to equal +0

[Killed] StringLiteral
src/robot-ml-typecheck.ts:307:18
 		return { type: "float" };
 	}
 	visitGetSpeed(_node: GetSpeed): Value {
-		return { type: "float" };
+		return { type: "" };
 	}
 	visitLiteral(node: Literal): Value {
killedBy: Parsing tests builtins
statusReason: expected 1 to equal +0

[Killed] BlockStatement
src/robot-ml-typecheck.ts:309:37
 	visitGetSpeed(_node: GetSpeed): Value {
 		return { type: "float" };
 	}
-	visitLiteral(node: Literal): Value {
-		switch (typeof node.value) {
-			case "string":
-				return { type: "string" };
-			case "number": {
-				if (isFloat(node.value)) {
-					return { type: "float" };
-				} else {
-					return { type: "integer" };
-				}
-			}
-			case "boolean":
-				return { type: "boolean" };
-		}
-	}
+	visitLiteral(node: Literal): Value {}
 	visitUnary(node: Unary): Value {
 		const { type } = this.visitExpression(node.expr);
killedBy: Parsing tests builtins
statusReason: expected 44 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:311:4
 	}
 	visitLiteral(node: Literal): Value {
 		switch (typeof node.value) {
-			case "string":
-				return { type: "string" };
+			case "string":
 			case "number": {
 				if (isFloat(node.value)) {
killedBy: Parsing tests Authorized additions
statusReason: expected 1 to equal +0

[Killed] StringLiteral
src/robot-ml-typecheck.ts:311:9
 	}
 	visitLiteral(node: Literal): Value {
 		switch (typeof node.value) {
-			case "string":
+			case "":
 				return { type: "string" };
 			case "number": {
killedBy: Parsing tests Add a int to a bool
statusReason: expected 4 to equal 5

[Killed] StringLiteral
src/robot-ml-typecheck.ts:312:20
 	visitLiteral(node: Literal): Value {
 		switch (typeof node.value) {
 			case "string":
-				return { type: "string" };
+				return { type: "" };
 			case "number": {
 				if (isFloat(node.value)) {
killedBy: Parsing tests Authorized additions
statusReason: expected 1 to equal +0

[Killed] BlockStatement
src/robot-ml-typecheck.ts:313:19
 		switch (typeof node.value) {
 			case "string":
 				return { type: "string" };
-			case "number": {
-				if (isFloat(node.value)) {
-					return { type: "float" };
-				} else {
-					return { type: "integer" };
-				}
-			}
+			case "number": {}
 			case "boolean":
 				return { type: "boolean" };
killedBy: Parsing tests builtins
statusReason: expected 16 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:313:4
 		switch (typeof node.value) {
 			case "string":
 				return { type: "string" };
-			case "number": {
-				if (isFloat(node.value)) {
-					return { type: "float" };
-				} else {
-					return { type: "integer" };
-				}
-			}
+			case "number":
 			case "boolean":
 				return { type: "boolean" };
killedBy: Parsing tests builtins
statusReason: expected 16 to equal +0

[Killed] BlockStatement
src/robot-ml-typecheck.ts:314:30
 			case "string":
 				return { type: "string" };
 			case "number": {
-				if (isFloat(node.value)) {
-					return { type: "float" };
-				} else {
+				if (isFloat(node.value)) {} else {
 					return { type: "integer" };
 				}
killedBy: Parsing tests builtins
statusReason: expected 8 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:314:9
 			case "string":
 				return { type: "string" };
 			case "number": {
-				if (isFloat(node.value)) {
+				if (false) {
 					return { type: "float" };
 				} else {
killedBy: Parsing tests Authorized additions
statusReason: expected 3 to equal +0

[Killed] BlockStatement
src/robot-ml-typecheck.ts:316:12
 			case "number": {
 				if (isFloat(node.value)) {
 					return { type: "float" };
-				} else {
-					return { type: "integer" };
-				}
+				} else {}
 			}
 			case "boolean":
killedBy: Parsing tests builtins
statusReason: expected 8 to equal +0

[Killed] ObjectLiteral
src/robot-ml-typecheck.ts:317:13
 				if (isFloat(node.value)) {
 					return { type: "float" };
 				} else {
-					return { type: "integer" };
+					return {};
 				}
 			}
killedBy: Parsing tests builtins
statusReason: expected 8 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:320:4
 					return { type: "integer" };
 				}
 			}
-			case "boolean":
-				return { type: "boolean" };
+			case "boolean":
 		}
 	}
killedBy: Parsing tests builtinsErr
statusReason: expected 26 to equal 12

[Killed] StringLiteral
src/robot-ml-typecheck.ts:321:20
 				}
 			}
 			case "boolean":
-				return { type: "boolean" };
+				return { type: "" };
 		}
 	}
killedBy: Parsing tests builtinsErr
statusReason: expected 19 to equal 12

[Killed] BlockStatement
src/robot-ml-typecheck.ts:324:33
 				return { type: "boolean" };
 		}
 	}
-	visitUnary(node: Unary): Value {
-		const { type } = this.visitExpression(node.expr);
-
-		const check =
-			(node.op === "!" && type === "boolean") ||
-			(node.op === "-" && (type === "integer" || type === "float"));
-
-		if (!check) {
-			this.validationAccept(
-				"error",
-				`Could not apply ${node.op} on a ${type}`,
-				{
-					node: node,
-				},
-			);
-		}
-
-		return { type: type };
-	}
+	visitUnary(node: Unary): Value {}
 	visitVariableRef(node: VariableRef): Value {
 		console.error(node.ref);
killedBy: Parsing tests builtinsErr
statusReason: expected 10 to equal 12

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:328:5
 		const { type } = this.visitExpression(node.expr);
 
 		const check =
-			(node.op === "!" && type === "boolean") ||
+			(node.op !== "!" && type === "boolean") ||
 			(node.op === "-" && (type === "integer" || type === "float"));
 
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] LogicalOperator
src/robot-ml-typecheck.ts:328:4
 		const { type } = this.visitExpression(node.expr);
 
 		const check =
-			(node.op === "!" && type === "boolean") ||
-			(node.op === "-" && (type === "integer" || type === "float"));
+			node.op === "!" && type === "boolean" && node.op === "-" && (type === "integer" || type === "float");
 
 		if (!check) {
killedBy: Parsing tests builtins
statusReason: expected 2 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:329:25
 
 		const check =
 			(node.op === "!" && type === "boolean") ||
-			(node.op === "-" && (type === "integer" || type === "float"));
+			(node.op === "-" && (true));
 
 		if (!check) {
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] LogicalOperator
src/robot-ml-typecheck.ts:329:5
 
 		const check =
 			(node.op === "!" && type === "boolean") ||
-			(node.op === "-" && (type === "integer" || type === "float"));
+			(node.op === "-" || type === "integer" || type === "float");
 
 		if (!check) {
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] BooleanLiteral
src/robot-ml-typecheck.ts:331:7
 			(node.op === "!" && type === "boolean") ||
 			(node.op === "-" && (type === "integer" || type === "float"));
 
-		if (!check) {
+		if (check) {
 			this.validationAccept(
 				"error",
killedBy: Parsing tests builtins
statusReason: expected 2 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:331:7
 			(node.op === "!" && type === "boolean") ||
 			(node.op === "-" && (type === "integer" || type === "float"));
 
-		if (!check) {
+		if (true) {
 			this.validationAccept(
 				"error",
killedBy: Parsing tests builtins
statusReason: expected 2 to equal +0

[Killed] ObjectLiteral
src/robot-ml-typecheck.ts:335:5
 			this.validationAccept(
 				"error",
 				`Could not apply ${node.op} on a ${type}`,
-				{
-					node: node,
-				},
+				{},
 			);
 		}
killedBy: Parsing tests builtinsErr
statusReason: expected 10 to equal 12

[Killed] BooleanLiteral
src/robot-ml-typecheck.ts:346:7
 	visitVariableRef(node: VariableRef): Value {
 		console.error(node.ref);
 
-		if (!node.ref.ref) {
+		if (node.ref.ref) {
 			this.validationAccept("error", `ref does not exist`, {
 				node: node,
killedBy: Parsing tests builtins
statusReason: expected 15 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:346:7
 	visitVariableRef(node: VariableRef): Value {
 		console.error(node.ref);
 
-		if (!node.ref.ref) {
+		if (true) {
 			this.validationAccept("error", `ref does not exist`, {
 				node: node,
killedBy: Parsing tests builtins
statusReason: expected 15 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:354:7
 
 		const name = node.ref.ref.name;
 
-		if (!this.symbolTable.inScope(name)) {
+		if (false) {
 			// console.trace(this.symbolTable.inScope(name));
 			this.validationAccept(
killedBy: Parsing tests Ingnore Variable
statusReason: expected +0 to equal 1

[Killed] BlockStatement
src/robot-ml-typecheck.ts:354:40
 
 		const name = node.ref.ref.name;
 
-		if (!this.symbolTable.inScope(name)) {
-			// console.trace(this.symbolTable.inScope(name));
-			this.validationAccept(
-				"error",
-				`Variable ${name} does not exist`,
-				{
-					node: node,
-				},
-			);
-		}
+		if (!this.symbolTable.inScope(name)) {}
 
 		const type = this.symbolTable.type(name);
killedBy: Parsing tests Ingnore Variable
statusReason: expected +0 to equal 1

[Killed] StringLiteral
src/robot-ml-typecheck.ts:358:5
 			// console.trace(this.symbolTable.inScope(name));
 			this.validationAccept(
 				"error",
-				`Variable ${name} does not exist`,
+				``,
 				{
 					node: node,
killedBy: Parsing tests Ingnore Variable
statusReason: expected '' to equal 'Variable _a does not exist'

[Killed] BlockStatement
src/robot-ml-typecheck.ts:375:30
 
 		return { type: type ?? "void" };
 	}
-	visitRobotML(node: RobotML) {
-		// throw new Error("Method not implemented.");
-
-		const main_function = node.functions.find((f) => f.name === "main");
-		if (main_function === undefined) {
-			this.validationAccept(
-				"error",
-				"There is no main functions defined",
-				{
-					node: node,
-				},
-			);
-		}
-
-		this.symbolTable.beginScope();
-
-		node.functions.forEach((node) => {
-			this.visitFunctionDeclaration(node);
-		});
-
-		this.symbolTable.endScope();
-	}
+	visitRobotML(node: RobotML) {}
 	visitStatement(node: Statement) {
 		try {
killedBy: Parsing tests should fail on empty input
statusReason: expected +0 to equal 1

[Killed] ArrowFunction
src/robot-ml-typecheck.ts:378:45
 	visitRobotML(node: RobotML) {
 		// throw new Error("Method not implemented.");
 
-		const main_function = node.functions.find((f) => f.name === "main");
+		const main_function = node.functions.find(() => undefined);
 		if (main_function === undefined) {
 			this.validationAccept(
killedBy: Parsing tests builtins
statusReason: expected 1 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:378:52
 	visitRobotML(node: RobotML) {
 		// throw new Error("Method not implemented.");
 
-		const main_function = node.functions.find((f) => f.name === "main");
+		const main_function = node.functions.find((f) => false);
 		if (main_function === undefined) {
 			this.validationAccept(
killedBy: Parsing tests builtins
statusReason: expected 1 to equal +0

[Killed] BlockStatement
src/robot-ml-typecheck.ts:379:36
 		// throw new Error("Method not implemented.");
 
 		const main_function = node.functions.find((f) => f.name === "main");
-		if (main_function === undefined) {
-			this.validationAccept(
-				"error",
-				"There is no main functions defined",
-				{
-					node: node,
-				},
-			);
-		}
+		if (main_function === undefined) {}
 
 		this.symbolTable.beginScope();
killedBy: Parsing tests should fail on empty input
statusReason: expected +0 to equal 1

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:379:7
 		// throw new Error("Method not implemented.");
 
 		const main_function = node.functions.find((f) => f.name === "main");
-		if (main_function === undefined) {
+		if (false) {
 			this.validationAccept(
 				"error",
killedBy: Parsing tests should fail on empty input
statusReason: expected +0 to equal 1

[Killed] BlockStatement
src/robot-ml-typecheck.ts:391:36
 
 		this.symbolTable.beginScope();
 
-		node.functions.forEach((node) => {
-			this.visitFunctionDeclaration(node);
-		});
+		node.functions.forEach((node) => {});
 
 		this.symbolTable.endScope();
killedBy: Parsing tests builtinsErr
statusReason: expected +0 to equal 12

[NoCoverage] ConditionalExpression
src/robot-ml-typecheck.ts:405:5
 						node as FunctionDeclaration,
 					);
 					break;
-				case "Block":
-					this.visitBlock(node as Block);
-					break;
+				case "Block":
 				case "VariableDec":
 					this.visitVariableDec(node as VariableDec);

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:411:5
 				case "VariableDec":
 					this.visitVariableDec(node as VariableDec);
 					break;
-				case "Loop":
-					this.visitLoop(node as Loop);
-					break;
+				case "Loop":
 				case "Assignation":
 					this.visitAssignation(node as Assignation);

[Survived] StringLiteral
src/robot-ml-typecheck.ts:411:10
 				case "VariableDec":
 					this.visitVariableDec(node as VariableDec);
 					break;
-				case "Loop":
+				case "":
 					this.visitLoop(node as Loop);
 					break;

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:414:5
 				case "Loop":
 					this.visitLoop(node as Loop);
 					break;
-				case "Assignation":
-					this.visitAssignation(node as Assignation);
-					break;
+				case "Assignation":
 				case "FunctionCall":
 					this.visitFunctionCall(node as FunctionCall);

[NoCoverage] ConditionalExpression
src/robot-ml-typecheck.ts:417:5
 				case "Assignation":
 					this.visitAssignation(node as Assignation);
 					break;
-				case "FunctionCall":
-					this.visitFunctionCall(node as FunctionCall);
-					break;
+				case "FunctionCall":
 				case "Condition":
 					this.visitCondition(node as Condition);

[Survived] StringLiteral
src/robot-ml-typecheck.ts:417:10
 				case "Assignation":
 					this.visitAssignation(node as Assignation);
 					break;
-				case "FunctionCall":
+				case "":
 					this.visitFunctionCall(node as FunctionCall);
 					break;

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:420:5
 				case "FunctionCall":
 					this.visitFunctionCall(node as FunctionCall);
 					break;
-				case "Condition":
-					this.visitCondition(node as Condition);
-					break;
+				case "Condition":
 				case "SetSpeed":
 					this.visitSetSpeed(node as SetSpeed);

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:426:5
 				case "SetSpeed":
 					this.visitSetSpeed(node as SetSpeed);
 					break;
-				case "SetClock":
-					this.visitSetClock(node as SetClock);
-					break;
+				case "SetClock":
 				case "Rotate":
 					this.visitRotate(node as Rotate);

[Killed] StringLiteral
src/robot-ml-typecheck.ts:426:10
 				case "SetSpeed":
 					this.visitSetSpeed(node as SetSpeed);
 					break;
-				case "SetClock":
+				case "":
 					this.visitSetClock(node as SetClock);
 					break;
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:429:5
 				case "SetClock":
 					this.visitSetClock(node as SetClock);
 					break;
-				case "Rotate":
-					this.visitRotate(node as Rotate);
-					break;
+				case "Rotate":
 				case "Forward":
 					this.visitForward(node as Forward);

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:432:5
 				case "Rotate":
 					this.visitRotate(node as Rotate);
 					break;
-				case "Forward":
-					this.visitForward(node as Forward);
-					break;
+				case "Forward":
 				case "Backward":
 					this.visitBackward(node as Backward);

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:435:5
 				case "Forward":
 					this.visitForward(node as Forward);
 					break;
-				case "Backward":
-					this.visitBackward(node as Backward);
-					break;
+				case "Backward":
 				case "Leftward":
 					this.visitLeftward(node as Leftward);

[Killed] StringLiteral
src/robot-ml-typecheck.ts:435:10
 				case "Forward":
 					this.visitForward(node as Forward);
 					break;
-				case "Backward":
+				case "":
 					this.visitBackward(node as Backward);
 					break;
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:438:5
 				case "Backward":
 					this.visitBackward(node as Backward);
 					break;
-				case "Leftward":
-					this.visitLeftward(node as Leftward);
-					break;
+				case "Leftward":
 				case "Rightward":
 					this.visitRightward(node as Rightward);

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:441:5
 				case "Leftward":
 					this.visitLeftward(node as Leftward);
 					break;
-				case "Rightward":
-					this.visitRightward(node as Rightward);
-					break;
+				case "Rightward":
 				case "FnReturn":
 					this.visitFnReturn(node as FnReturn);
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] StringLiteral
src/robot-ml-typecheck.ts:441:10
 				case "Leftward":
 					this.visitLeftward(node as Leftward);
 					break;
-				case "Rightward":
+				case "":
 					this.visitRightward(node as Rightward);
 					break;
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Survived] BlockStatement
src/robot-ml-typecheck.ts:452:38
 			}
 		} catch {}
 	}
-	visitAssignation(node: Assignation) {
-		this.visitVariableRef(node.variableRef);
-		this.visitExpression(node.expression);
-		// FIXME: Check type
-	}
+	visitAssignation(node: Assignation) {}
 
 	visitBlock(node: Block) {

[Killed] BlockStatement
src/robot-ml-typecheck.ts:458:26
 		// FIXME: Check type
 	}
 
-	visitBlock(node: Block) {
-		this.symbolTable.beginScope();
-
-		node.statements.forEach((s) => {
-			this.visitStatement(s);
-		});
-
-		this.symbolTable.beginScope();
-	}
+	visitBlock(node: Block) {}
 	visitCondition(node: Condition) {
 		node.conditions.forEach((value, index) => {
killedBy: Parsing tests builtinsErr
statusReason: expected +0 to equal 12

[Killed] BlockStatement
src/robot-ml-typecheck.ts:461:34
 	visitBlock(node: Block) {
 		this.symbolTable.beginScope();
 
-		node.statements.forEach((s) => {
-			this.visitStatement(s);
-		});
+		node.statements.forEach((s) => {});
 
 		this.symbolTable.beginScope();
killedBy: Parsing tests builtinsErr
statusReason: expected +0 to equal 12

[Survived] BlockStatement
src/robot-ml-typecheck.ts:467:34
 
 		this.symbolTable.beginScope();
 	}
-	visitCondition(node: Condition) {
-		node.conditions.forEach((value, index) => {
-			this.visitExpression(value);
-			this.visitBlock(node.block.at(index));
-		});
-
-		if (node.conditions.length < node.block.length) {
-			this.visitBlock(node.block.at(-1));
-		}
-	}
+	visitCondition(node: Condition) {}
 	visitFnReturn(node: FnReturn) {
 		// TODO add check for return type on function decl

[Survived] BlockStatement
src/robot-ml-typecheck.ts:468:45
 		this.symbolTable.beginScope();
 	}
 	visitCondition(node: Condition) {
-		node.conditions.forEach((value, index) => {
-			this.visitExpression(value);
-			this.visitBlock(node.block.at(index));
-		});
+		node.conditions.forEach((value, index) => {});
 
 		if (node.conditions.length < node.block.length) {

[Survived] EqualityOperator
src/robot-ml-typecheck.ts:473:7
 			this.visitBlock(node.block.at(index));
 		});
 
-		if (node.conditions.length < node.block.length) {
+		if (node.conditions.length <= node.block.length) {
 			this.visitBlock(node.block.at(-1));
 		}

[Survived] ConditionalExpression
src/robot-ml-typecheck.ts:473:7
 			this.visitBlock(node.block.at(index));
 		});
 
-		if (node.conditions.length < node.block.length) {
+		if (false) {
 			this.visitBlock(node.block.at(-1));
 		}

[Survived] UnaryOperator
src/robot-ml-typecheck.ts:474:34
 		});
 
 		if (node.conditions.length < node.block.length) {
-			this.visitBlock(node.block.at(-1));
+			this.visitBlock(node.block.at(+1));
 		}
 	}

[Survived] BlockStatement
src/robot-ml-typecheck.ts:477:32
 			this.visitBlock(node.block.at(-1));
 		}
 	}
-	visitFnReturn(node: FnReturn) {
-		// TODO add check for return type on function decl
-		this.visitExpression(node.expression);
-	}
+	visitFnReturn(node: FnReturn) {}
 	visitFunctionDeclaration(node: FunctionDeclaration) {
 		var type = node.returnType ?? "void";

[Killed] BlockStatement
src/robot-ml-typecheck.ts:481:54
 		// TODO add check for return type on function decl
 		this.visitExpression(node.expression);
 	}
-	visitFunctionDeclaration(node: FunctionDeclaration) {
-		var type = node.returnType ?? "void";
-
-		this.symbolTable.put(node.name, type, { node: node });
-
-		node.parameters.forEach((p) => {
-			this.visitArgumentDec(p);
-		});
-
-		this.visitBlock(node.block);
-	}
+	visitFunctionDeclaration(node: FunctionDeclaration) {}
 	visitLoop(node: Loop) {
 		this.visitExpression(node.condition);
killedBy: Parsing tests builtinsErr
statusReason: expected +0 to equal 12

[Killed] LogicalOperator
src/robot-ml-typecheck.ts:482:14
 		this.visitExpression(node.expression);
 	}
 	visitFunctionDeclaration(node: FunctionDeclaration) {
-		var type = node.returnType ?? "void";
+		var type = node.returnType && "void";
 
 		this.symbolTable.put(node.name, type, { node: node });
killedBy: Parsing tests function
statusReason: expected 2 to equal +0

[Survived] ObjectLiteral
src/robot-ml-typecheck.ts:484:41
 	visitFunctionDeclaration(node: FunctionDeclaration) {
 		var type = node.returnType ?? "void";
 
-		this.symbolTable.put(node.name, type, { node: node });
+		this.symbolTable.put(node.name, type, {});
 
 		node.parameters.forEach((p) => {

[Killed] BlockStatement
src/robot-ml-typecheck.ts:486:34
 
 		this.symbolTable.put(node.name, type, { node: node });
 
-		node.parameters.forEach((p) => {
-			this.visitArgumentDec(p);
-		});
+		node.parameters.forEach((p) => {});
 
 		this.visitBlock(node.block);
killedBy: Parsing tests controlflow
statusReason: expected 3 to equal +0

[Survived] BlockStatement
src/robot-ml-typecheck.ts:492:24
 
 		this.visitBlock(node.block);
 	}
-	visitLoop(node: Loop) {
-		this.visitExpression(node.condition);
-		this.visitBlock(node.block);
-	}
+	visitLoop(node: Loop) {}
 	visitMovement(node: Movement) {
 		const { type } = this.visitExpression(node.expression);

[NoCoverage] BlockStatement
src/robot-ml-typecheck.ts:496:32
 		this.visitExpression(node.condition);
 		this.visitBlock(node.block);
 	}
-	visitMovement(node: Movement) {
-		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
-			this.validationAccept(
-				"error",
-				`Movement does not support type ${type}`,
-				{
-					node: node,
-				},
-			);
-		}
-	}
+	visitMovement(node: Movement) {}
 	visitBackward(node: Backward) {
 		const { type } = this.visitExpression(node.expression);

[NoCoverage] LogicalOperator
src/robot-ml-typecheck.ts:498:7
 	}
 	visitMovement(node: Movement) {
 		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
+		if (type !== "float" || type !== "integer") {
 			this.validationAccept(
 				"error",

[NoCoverage] ConditionalExpression
src/robot-ml-typecheck.ts:498:7
 	}
 	visitMovement(node: Movement) {
 		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
+		if (false) {
 			this.validationAccept(
 				"error",

[Killed] BlockStatement
src/robot-ml-typecheck.ts:508:32
 			);
 		}
 	}
-	visitBackward(node: Backward) {
-		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
-			this.validationAccept(
-				"error",
-				`Backward does not support type ${type}`,
-				{
-					node: node,
-				},
-			);
-		}
-	}
+	visitBackward(node: Backward) {}
 	visitForward(node: Forward) {
 		const { type } = this.visitExpression(node.expression);
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] BlockStatement
src/robot-ml-typecheck.ts:510:47
 	}
 	visitBackward(node: Backward) {
 		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
-			this.validationAccept(
-				"error",
-				`Backward does not support type ${type}`,
-				{
-					node: node,
-				},
-			);
-		}
+		if (type !== "float" && type !== "integer") {}
 	}
 	visitForward(node: Forward) {
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] BlockStatement
src/robot-ml-typecheck.ts:520:30
 			);
 		}
 	}
-	visitForward(node: Forward) {
-		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
-			this.validationAccept(
-				"error",
-				`Forward does not support type ${type}`,
-				{
-					node: node,
-				},
-			);
-		}
-	}
+	visitForward(node: Forward) {}
 	visitLeftward(node: Leftward) {
 		const { type } = this.visitExpression(node.expression);
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] BlockStatement
src/robot-ml-typecheck.ts:522:47
 	}
 	visitForward(node: Forward) {
 		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
-			this.validationAccept(
-				"error",
-				`Forward does not support type ${type}`,
-				{
-					node: node,
-				},
-			);
-		}
+		if (type !== "float" && type !== "integer") {}
 	}
 	visitLeftward(node: Leftward) {
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] StringLiteral
src/robot-ml-typecheck.ts:524:5
 		const { type } = this.visitExpression(node.expression);
 		if (type !== "float" && type !== "integer") {
 			this.validationAccept(
-				"error",
+				"",
 				`Forward does not support type ${type}`,
 				{
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] ObjectLiteral
src/robot-ml-typecheck.ts:526:5
 			this.validationAccept(
 				"error",
 				`Forward does not support type ${type}`,
-				{
-					node: node,
-				},
+				{},
 			);
 		}
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] BlockStatement
src/robot-ml-typecheck.ts:532:32
 			);
 		}
 	}
-	visitLeftward(node: Leftward) {
-		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
-			this.validationAccept(
-				"error",
-				`Leftward does not support type ${type}`,
-				{
-					node: node,
-				},
-			);
-		}
-	}
+	visitLeftward(node: Leftward) {}
 	visitRightward(node: Rightward) {
 		const { type } = this.visitExpression(node.expression);
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:534:7
 	}
 	visitLeftward(node: Leftward) {
 		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
+		if (true) {
 			this.validationAccept(
 				"error",
killedBy: Parsing tests builtins
statusReason: expected 2 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:534:7
 	}
 	visitLeftward(node: Leftward) {
 		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
+		if (true && type !== "integer") {
 			this.validationAccept(
 				"error",
killedBy: Parsing tests builtins
statusReason: expected 1 to equal +0

[Killed] ObjectLiteral
src/robot-ml-typecheck.ts:538:5
 			this.validationAccept(
 				"error",
 				`Leftward does not support type ${type}`,
-				{
-					node: node,
-				},
+				{},
 			);
 		}
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] BlockStatement
src/robot-ml-typecheck.ts:544:34
 			);
 		}
 	}
-	visitRightward(node: Rightward) {
-		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
-			this.validationAccept(
-				"error",
-				`Rightward does not support type ${type}`,
-				{
-					node: node,
-				},
-			);
-		}
-	}
+	visitRightward(node: Rightward) {}
 	visitRotate(node: Rotate) {
 		const { type } = this.visitExpression(node.expression);
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:546:27
 	}
 	visitRightward(node: Rightward) {
 		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
+		if (type !== "float" && true) {
 			this.validationAccept(
 				"error",
killedBy: Parsing tests builtins
statusReason: expected 1 to equal +0

[Survived] StringLiteral
src/robot-ml-typecheck.ts:549:5
 		if (type !== "float" && type !== "integer") {
 			this.validationAccept(
 				"error",
-				`Rightward does not support type ${type}`,
+				``,
 				{
 					node: node,

[Killed] ObjectLiteral
src/robot-ml-typecheck.ts:550:5
 			this.validationAccept(
 				"error",
 				`Rightward does not support type ${type}`,
-				{
-					node: node,
-				},
+				{},
 			);
 		}
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12
