[Killed] BlockStatement
src/robot-ml-typecheck.ts:556:28
 			);
 		}
 	}
-	visitRotate(node: Rotate) {
-		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
-			this.validationAccept(
-				"error",
-				`Rotate does not support type ${type}`,
-				{
-					node: node,
-				},
-			);
-		}
-	}
+	visitRotate(node: Rotate) {}
 	visitSetClock(node: SetClock) {
 		const { type } = this.visitExpression(node.expression);
killedBy: Parsing tests builtinsErr
statusReason: expected 10 to equal 12

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:558:27
 	}
 	visitRotate(node: Rotate) {
 		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
+		if (type !== "float" && type === "integer") {
 			this.validationAccept(
 				"error",
killedBy: Parsing tests builtins
statusReason: expected 1 to equal +0

[Killed] ObjectLiteral
src/robot-ml-typecheck.ts:562:5
 			this.validationAccept(
 				"error",
 				`Rotate does not support type ${type}`,
-				{
-					node: node,
-				},
+				{},
 			);
 		}
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] BlockStatement
src/robot-ml-typecheck.ts:568:32
 			);
 		}
 	}
-	visitSetClock(node: SetClock) {
-		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
-			this.validationAccept(
-				"error",
-				`SetClock does not support type ${type}`,
-				{
-					node: node,
-				},
-			);
-		}
-	}
+	visitSetClock(node: SetClock) {}
 	visitSetSpeed(node: SetSpeed) {
 		const { type } = this.visitExpression(node.expression);
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] BlockStatement
src/robot-ml-typecheck.ts:570:47
 	}
 	visitSetClock(node: SetClock) {
 		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
-			this.validationAccept(
-				"error",
-				`SetClock does not support type ${type}`,
-				{
-					node: node,
-				},
-			);
-		}
+		if (type !== "float" && type !== "integer") {}
 	}
 	visitSetSpeed(node: SetSpeed) {
killedBy: Parsing tests builtinsErr
statusReason: expected 11 to equal 12

[Killed] BlockStatement
src/robot-ml-typecheck.ts:580:32
 			);
 		}
 	}
-	visitSetSpeed(node: SetSpeed) {
-		const { type } = this.visitExpression(node.expression);
-		if (type !== "float" && type !== "integer") {
-			this.validationAccept(
-				"error",
-				`SetSpeed does not support type ${type}`,
-				{
-					node: node,
-				},
-			);
-		}
-	}
+	visitSetSpeed(node: SetSpeed) {}
 	visitVariableDec(node: VariableDec) {
 		if (node.expression) {
killedBy: Parsing tests builtinsErr
statusReason: expected 10 to equal 12

[Killed] BlockStatement
src/robot-ml-typecheck.ts:592:38
 			);
 		}
 	}
-	visitVariableDec(node: VariableDec) {
-		if (node.expression) {
-			const { type } = this.visitExpression(node.expression);
-			if (!node.type) {
-				node.type = type;
-			}
-			if (node.type !== type) {
-				this.validationAccept(
-					"error",
-					`Missmatch type between rtype ${type} and ltype ${node.type} `,
-					{
-						node: node,
-					},
-				);
-			}
-		}
-
-		if (!node.name.startsWith("_")) {
-			this.symbolTable.put(node.name, node.type ?? "void", { node });
-		}
-	}
+	visitVariableDec(node: VariableDec) {}
 }
 
killedBy: Parsing tests builtins
statusReason: expected 47 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:593:7
 		}
 	}
 	visitVariableDec(node: VariableDec) {
-		if (node.expression) {
+		if (true) {
 			const { type } = this.visitExpression(node.expression);
 			if (!node.type) {
killedBy: Parsing tests Add a int to a bool
statusReason: expected 13 to equal 5

[Killed] BlockStatement
src/robot-ml-typecheck.ts:593:24
 		}
 	}
 	visitVariableDec(node: VariableDec) {
-		if (node.expression) {
-			const { type } = this.visitExpression(node.expression);
-			if (!node.type) {
-				node.type = type;
-			}
-			if (node.type !== type) {
-				this.validationAccept(
-					"error",
-					`Missmatch type between rtype ${type} and ltype ${node.type} `,
-					{
-						node: node,
-					},
-				);
-			}
-		}
+		if (node.expression) {}
 
 		if (!node.name.startsWith("_")) {
killedBy: Parsing tests builtins
statusReason: expected 16 to equal +0

[Killed] BlockStatement
src/robot-ml-typecheck.ts:595:20
 	visitVariableDec(node: VariableDec) {
 		if (node.expression) {
 			const { type } = this.visitExpression(node.expression);
-			if (!node.type) {
-				node.type = type;
-			}
+			if (!node.type) {}
 			if (node.type !== type) {
 				this.validationAccept(
killedBy: Parsing tests builtins
statusReason: expected 20 to equal +0

[Killed] BooleanLiteral
src/robot-ml-typecheck.ts:595:8
 	visitVariableDec(node: VariableDec) {
 		if (node.expression) {
 			const { type } = this.visitExpression(node.expression);
-			if (!node.type) {
+			if (node.type) {
 				node.type = type;
 			}
killedBy: Parsing tests builtins
statusReason: expected 20 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:598:8
 			if (!node.type) {
 				node.type = type;
 			}
-			if (node.type !== type) {
+			if (false) {
 				this.validationAccept(
 					"error",
killedBy: Parsing tests builtinsErr
statusReason: expected 9 to equal 12

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:598:8
 			if (!node.type) {
 				node.type = type;
 			}
-			if (node.type !== type) {
+			if (true) {
 				this.validationAccept(
 					"error",
killedBy: Parsing tests builtins
statusReason: expected 5 to equal +0

[Survived] StringLiteral
src/robot-ml-typecheck.ts:601:6
 			if (node.type !== type) {
 				this.validationAccept(
 					"error",
-					`Missmatch type between rtype ${type} and ltype ${node.type} `,
+					``,
 					{
 						node: node,

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:609:7
 			}
 		}
 
-		if (!node.name.startsWith("_")) {
+		if (false) {
 			this.symbolTable.put(node.name, node.type ?? "void", { node });
 		}
killedBy: Parsing tests builtins
statusReason: expected 47 to equal +0

[Killed] BooleanLiteral
src/robot-ml-typecheck.ts:609:7
 			}
 		}
 
-		if (!node.name.startsWith("_")) {
+		if (node.name.startsWith("_")) {
 			this.symbolTable.put(node.name, node.type ?? "void", { node });
 		}
killedBy: Parsing tests builtins
statusReason: expected 47 to equal +0

[Killed] LogicalOperator
src/robot-ml-typecheck.ts:610:36
 		}
 
 		if (!node.name.startsWith("_")) {
-			this.symbolTable.put(node.name, node.type ?? "void", { node });
+			this.symbolTable.put(node.name, node.type && "void", { node });
 		}
 	}
killedBy: Parsing tests builtins
statusReason: expected 17 to equal +0

[Survived] ObjectLiteral
src/robot-ml-typecheck.ts:610:57
 		}
 
 		if (!node.name.startsWith("_")) {
-			this.symbolTable.put(node.name, node.type ?? "void", { node });
+			this.symbolTable.put(node.name, node.type ?? "void", {});
 		}
 	}
