[Killed] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:52:48
 
     private readonly cache: ContextCache<AstNode, string, void>;
 
-    constructor(services: LangiumCoreServices) {
-        this.cache = new ContextCache<AstNode, string, void>();
-        services.shared.workspace.DocumentBuilder.onDocumentPhase(DocumentState.IndexedReferences, (document) => {
-            if(!document.diagnostics || document.diagnostics.filter(d => d.severity === DiagnosticSeverity.Error).length === 0) {
-                AstUtils.streamAst(document.parseResult.value).forEach((node: AstNode) => {
-                    if(!this.cache.has(node, 'weaved')) {
-                        const nodeType = node.$type as keyof Weaver;
-                        const weaveFunction = this.checks[nodeType]; 
-                        if (weaveFunction) {
-                            weaveFunction(node as any);
-                            this.cache.set(node, 'weaved', undefined);
-                        }
-                    }
-                });
-            }
-        });
-    }
+    constructor(services: LangiumCoreServices) {}
 
     
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:54:114
 
     constructor(services: LangiumCoreServices) {
         this.cache = new ContextCache<AstNode, string, void>();
-        services.shared.workspace.DocumentBuilder.onDocumentPhase(DocumentState.IndexedReferences, (document) => {
-            if(!document.diagnostics || document.diagnostics.filter(d => d.severity === DiagnosticSeverity.Error).length === 0) {
-                AstUtils.streamAst(document.parseResult.value).forEach((node: AstNode) => {
-                    if(!this.cache.has(node, 'weaved')) {
-                        const nodeType = node.$type as keyof Weaver;
-                        const weaveFunction = this.checks[nodeType]; 
-                        if (weaveFunction) {
-                            weaveFunction(node as any);
-                            this.cache.set(node, 'weaved', undefined);
-                        }
-                    }
-                });
-            }
-        });
+        services.shared.workspace.DocumentBuilder.onDocumentPhase(DocumentState.IndexedReferences, (document) => {});
     }
 
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:55:129
     constructor(services: LangiumCoreServices) {
         this.cache = new ContextCache<AstNode, string, void>();
         services.shared.workspace.DocumentBuilder.onDocumentPhase(DocumentState.IndexedReferences, (document) => {
-            if(!document.diagnostics || document.diagnostics.filter(d => d.severity === DiagnosticSeverity.Error).length === 0) {
-                AstUtils.streamAst(document.parseResult.value).forEach((node: AstNode) => {
-                    if(!this.cache.has(node, 'weaved')) {
-                        const nodeType = node.$type as keyof Weaver;
-                        const weaveFunction = this.checks[nodeType]; 
-                        if (weaveFunction) {
-                            weaveFunction(node as any);
-                            this.cache.set(node, 'weaved', undefined);
-                        }
-                    }
-                });
-            }
+            if(!document.diagnostics || document.diagnostics.filter(d => d.severity === DiagnosticSeverity.Error).length === 0) {}
         });
     }
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] BooleanLiteral
src/semantics/robot-ml-accept-weaver.ts:55:16
     constructor(services: LangiumCoreServices) {
         this.cache = new ContextCache<AstNode, string, void>();
         services.shared.workspace.DocumentBuilder.onDocumentPhase(DocumentState.IndexedReferences, (document) => {
-            if(!document.diagnostics || document.diagnostics.filter(d => d.severity === DiagnosticSeverity.Error).length === 0) {
+            if(document.diagnostics || document.diagnostics.filter(d => d.severity === DiagnosticSeverity.Error).length === 0) {
                 AstUtils.streamAst(document.parseResult.value).forEach((node: AstNode) => {
                     if(!this.cache.has(node, 'weaved')) {
killedBy: Parsing tests should fail on empty input
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:56:91
         this.cache = new ContextCache<AstNode, string, void>();
         services.shared.workspace.DocumentBuilder.onDocumentPhase(DocumentState.IndexedReferences, (document) => {
             if(!document.diagnostics || document.diagnostics.filter(d => d.severity === DiagnosticSeverity.Error).length === 0) {
-                AstUtils.streamAst(document.parseResult.value).forEach((node: AstNode) => {
-                    if(!this.cache.has(node, 'weaved')) {
-                        const nodeType = node.$type as keyof Weaver;
-                        const weaveFunction = this.checks[nodeType]; 
-                        if (weaveFunction) {
-                            weaveFunction(node as any);
-                            this.cache.set(node, 'weaved', undefined);
-                        }
-                    }
-                });
+                AstUtils.streamAst(document.parseResult.value).forEach((node: AstNode) => {});
             }
         });
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:57:57
         services.shared.workspace.DocumentBuilder.onDocumentPhase(DocumentState.IndexedReferences, (document) => {
             if(!document.diagnostics || document.diagnostics.filter(d => d.severity === DiagnosticSeverity.Error).length === 0) {
                 AstUtils.streamAst(document.parseResult.value).forEach((node: AstNode) => {
-                    if(!this.cache.has(node, 'weaved')) {
-                        const nodeType = node.$type as keyof Weaver;
-                        const weaveFunction = this.checks[nodeType]; 
-                        if (weaveFunction) {
-                            weaveFunction(node as any);
-                            this.cache.set(node, 'weaved', undefined);
-                        }
-                    }
+                    if(!this.cache.has(node, 'weaved')) {}
                 });
             }
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] ConditionalExpression
src/semantics/robot-ml-accept-weaver.ts:57:24
         services.shared.workspace.DocumentBuilder.onDocumentPhase(DocumentState.IndexedReferences, (document) => {
             if(!document.diagnostics || document.diagnostics.filter(d => d.severity === DiagnosticSeverity.Error).length === 0) {
                 AstUtils.streamAst(document.parseResult.value).forEach((node: AstNode) => {
-                    if(!this.cache.has(node, 'weaved')) {
+                    if(false) {
                         const nodeType = node.$type as keyof Weaver;
                         const weaveFunction = this.checks[nodeType]; 
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] ConditionalExpression
src/semantics/robot-ml-accept-weaver.ts:60:29
                     if(!this.cache.has(node, 'weaved')) {
                         const nodeType = node.$type as keyof Weaver;
                         const weaveFunction = this.checks[nodeType]; 
-                        if (weaveFunction) {
+                        if (true) {
                             weaveFunction(node as any);
                             this.cache.set(node, 'weaved', undefined);
killedBy: Parsing tests Authorized additions
statusReason: weaveFunction is not a function

[Killed] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:60:44
                     if(!this.cache.has(node, 'weaved')) {
                         const nodeType = node.$type as keyof Weaver;
                         const weaveFunction = this.checks[nodeType]; 
-                        if (weaveFunction) {
-                            weaveFunction(node as any);
-                            this.cache.set(node, 'weaved', undefined);
-                        }
+                        if (weaveFunction) {}
                     }
                 });
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:71:62
     }
 
     
-    weaveArgumentDec(node : InterfaceAST.ArgumentDec) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitArgumentDec(node as unknown as ClassAST.ArgumentDec); }
-    }
+    weaveArgumentDec(node : InterfaceAST.ArgumentDec) : void {}
     
     weaveFunctionCall(node : InterfaceAST.FunctionCall) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:72:60
 
     
     weaveArgumentDec(node : InterfaceAST.ArgumentDec) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitArgumentDec(node as unknown as ClassAST.ArgumentDec); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:75:64
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitArgumentDec(node as unknown as ClassAST.ArgumentDec); }
     }
     
-    weaveFunctionCall(node : InterfaceAST.FunctionCall) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitFunctionCall(node as unknown as ClassAST.FunctionCall); }
-    }
+    weaveFunctionCall(node : InterfaceAST.FunctionCall) : void {}
     
     weaveGetClock(node : InterfaceAST.GetClock) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:76:60
     }
     
     weaveFunctionCall(node : InterfaceAST.FunctionCall) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitFunctionCall(node as unknown as ClassAST.FunctionCall); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:79:56
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitFunctionCall(node as unknown as ClassAST.FunctionCall); }
     }
     
-    weaveGetClock(node : InterfaceAST.GetClock) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitGetClock(node as unknown as ClassAST.GetClock); }
-    }
+    weaveGetClock(node : InterfaceAST.GetClock) : void {}
     
     weaveGetSensor(node : InterfaceAST.GetSensor) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:80:60
     }
     
     weaveGetClock(node : InterfaceAST.GetClock) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitGetClock(node as unknown as ClassAST.GetClock); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:83:58
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitGetClock(node as unknown as ClassAST.GetClock); }
     }
     
-    weaveGetSensor(node : InterfaceAST.GetSensor) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitGetSensor(node as unknown as ClassAST.GetSensor); }
-    }
+    weaveGetSensor(node : InterfaceAST.GetSensor) : void {}
     
     weaveGetSpeed(node : InterfaceAST.GetSpeed) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:84:60
     }
     
     weaveGetSensor(node : InterfaceAST.GetSensor) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitGetSensor(node as unknown as ClassAST.GetSensor); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:87:56
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitGetSensor(node as unknown as ClassAST.GetSensor); }
     }
     
-    weaveGetSpeed(node : InterfaceAST.GetSpeed) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitGetSpeed(node as unknown as ClassAST.GetSpeed); }
-    }
+    weaveGetSpeed(node : InterfaceAST.GetSpeed) : void {}
     
     weaveLiteral(node : InterfaceAST.Literal) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:88:60
     }
     
     weaveGetSpeed(node : InterfaceAST.GetSpeed) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitGetSpeed(node as unknown as ClassAST.GetSpeed); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:91:54
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitGetSpeed(node as unknown as ClassAST.GetSpeed); }
     }
     
-    weaveLiteral(node : InterfaceAST.Literal) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitLiteral(node as unknown as ClassAST.Literal); }
-    }
+    weaveLiteral(node : InterfaceAST.Literal) : void {}
     
     weaveUnary(node : InterfaceAST.Unary) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:92:60
     }
     
     weaveLiteral(node : InterfaceAST.Literal) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitLiteral(node as unknown as ClassAST.Literal); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:95:50
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitLiteral(node as unknown as ClassAST.Literal); }
     }
     
-    weaveUnary(node : InterfaceAST.Unary) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitUnary(node as unknown as ClassAST.Unary); }
-    }
+    weaveUnary(node : InterfaceAST.Unary) : void {}
     
     weaveVariableRef(node : InterfaceAST.VariableRef) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:96:60
     }
     
     weaveUnary(node : InterfaceAST.Unary) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitUnary(node as unknown as ClassAST.Unary); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:99:62
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitUnary(node as unknown as ClassAST.Unary); }
     }
     
-    weaveVariableRef(node : InterfaceAST.VariableRef) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitVariableRef(node as unknown as ClassAST.VariableRef); }
-    }
+    weaveVariableRef(node : InterfaceAST.VariableRef) : void {}
     
     weaveRobotML(node : InterfaceAST.RobotML) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:100:60
     }
     
     weaveVariableRef(node : InterfaceAST.VariableRef) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitVariableRef(node as unknown as ClassAST.VariableRef); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Killed] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:103:54
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitVariableRef(node as unknown as ClassAST.VariableRef); }
     }
     
-    weaveRobotML(node : InterfaceAST.RobotML) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitRobotML(node as unknown as ClassAST.RobotML); }
-    }
+    weaveRobotML(node : InterfaceAST.RobotML) : void {}
     
     weaveAssignation(node : InterfaceAST.Assignation) : void {
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:104:60
     }
     
     weaveRobotML(node : InterfaceAST.RobotML) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitRobotML(node as unknown as ClassAST.RobotML); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     
killedBy: Parsing tests should fail on empty input
statusReason: expected +0 to equal 1

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:107:62
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitRobotML(node as unknown as ClassAST.RobotML); }
     }
     
-    weaveAssignation(node : InterfaceAST.Assignation) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitAssignation(node as unknown as ClassAST.Assignation); }
-    }
+    weaveAssignation(node : InterfaceAST.Assignation) : void {}
     
     weaveBlock(node : InterfaceAST.Block) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:108:60
     }
     
     weaveAssignation(node : InterfaceAST.Assignation) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitAssignation(node as unknown as ClassAST.Assignation); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:111:50
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitAssignation(node as unknown as ClassAST.Assignation); }
     }
     
-    weaveBlock(node : InterfaceAST.Block) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitBlock(node as unknown as ClassAST.Block); }
-    }
+    weaveBlock(node : InterfaceAST.Block) : void {}
     
     weaveCondition(node : InterfaceAST.Condition) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:112:60
     }
     
     weaveBlock(node : InterfaceAST.Block) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitBlock(node as unknown as ClassAST.Block); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:115:58
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitBlock(node as unknown as ClassAST.Block); }
     }
     
-    weaveCondition(node : InterfaceAST.Condition) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitCondition(node as unknown as ClassAST.Condition); }
-    }
+    weaveCondition(node : InterfaceAST.Condition) : void {}
     
     weaveFnReturn(node : InterfaceAST.FnReturn) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:116:60
     }
     
     weaveCondition(node : InterfaceAST.Condition) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitCondition(node as unknown as ClassAST.Condition); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:119:56
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitCondition(node as unknown as ClassAST.Condition); }
     }
     
-    weaveFnReturn(node : InterfaceAST.FnReturn) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitFnReturn(node as unknown as ClassAST.FnReturn); }
-    }
+    weaveFnReturn(node : InterfaceAST.FnReturn) : void {}
     
     weaveFunctionDeclaration(node : InterfaceAST.FunctionDeclaration) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:120:60
     }
     
     weaveFnReturn(node : InterfaceAST.FnReturn) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitFnReturn(node as unknown as ClassAST.FnReturn); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:123:78
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitFnReturn(node as unknown as ClassAST.FnReturn); }
     }
     
-    weaveFunctionDeclaration(node : InterfaceAST.FunctionDeclaration) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitFunctionDeclaration(node as unknown as ClassAST.FunctionDeclaration); }
-    }
+    weaveFunctionDeclaration(node : InterfaceAST.FunctionDeclaration) : void {}
     
     weaveLoop(node : InterfaceAST.Loop) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:124:60
     }
     
     weaveFunctionDeclaration(node : InterfaceAST.FunctionDeclaration) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitFunctionDeclaration(node as unknown as ClassAST.FunctionDeclaration); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:127:48
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitFunctionDeclaration(node as unknown as ClassAST.FunctionDeclaration); }
     }
     
-    weaveLoop(node : InterfaceAST.Loop) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitLoop(node as unknown as ClassAST.Loop); }
-    }
+    weaveLoop(node : InterfaceAST.Loop) : void {}
     
     weaveBackward(node : InterfaceAST.Backward) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:128:60
     }
     
     weaveLoop(node : InterfaceAST.Loop) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitLoop(node as unknown as ClassAST.Loop); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:131:56
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitLoop(node as unknown as ClassAST.Loop); }
     }
     
-    weaveBackward(node : InterfaceAST.Backward) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitBackward(node as unknown as ClassAST.Backward); }
-    }
+    weaveBackward(node : InterfaceAST.Backward) : void {}
     
     weaveForward(node : InterfaceAST.Forward) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:132:60
     }
     
     weaveBackward(node : InterfaceAST.Backward) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitBackward(node as unknown as ClassAST.Backward); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:135:54
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitBackward(node as unknown as ClassAST.Backward); }
     }
     
-    weaveForward(node : InterfaceAST.Forward) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitForward(node as unknown as ClassAST.Forward); }
-    }
+    weaveForward(node : InterfaceAST.Forward) : void {}
     
     weaveLeftward(node : InterfaceAST.Leftward) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:136:60
     }
     
     weaveForward(node : InterfaceAST.Forward) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitForward(node as unknown as ClassAST.Forward); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:139:56
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitForward(node as unknown as ClassAST.Forward); }
     }
     
-    weaveLeftward(node : InterfaceAST.Leftward) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitLeftward(node as unknown as ClassAST.Leftward); }
-    }
+    weaveLeftward(node : InterfaceAST.Leftward) : void {}
     
     weaveRightward(node : InterfaceAST.Rightward) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:140:60
     }
     
     weaveLeftward(node : InterfaceAST.Leftward) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitLeftward(node as unknown as ClassAST.Leftward); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:143:58
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitLeftward(node as unknown as ClassAST.Leftward); }
     }
     
-    weaveRightward(node : InterfaceAST.Rightward) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitRightward(node as unknown as ClassAST.Rightward); }
-    }
+    weaveRightward(node : InterfaceAST.Rightward) : void {}
     
     weaveRotate(node : InterfaceAST.Rotate) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:144:60
     }
     
     weaveRightward(node : InterfaceAST.Rightward) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitRightward(node as unknown as ClassAST.Rightward); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:147:52
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitRightward(node as unknown as ClassAST.Rightward); }
     }
     
-    weaveRotate(node : InterfaceAST.Rotate) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitRotate(node as unknown as ClassAST.Rotate); }
-    }
+    weaveRotate(node : InterfaceAST.Rotate) : void {}
     
     weaveSetClock(node : InterfaceAST.SetClock) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:148:60
     }
     
     weaveRotate(node : InterfaceAST.Rotate) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitRotate(node as unknown as ClassAST.Rotate); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:151:56
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitRotate(node as unknown as ClassAST.Rotate); }
     }
     
-    weaveSetClock(node : InterfaceAST.SetClock) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitSetClock(node as unknown as ClassAST.SetClock); }
-    }
+    weaveSetClock(node : InterfaceAST.SetClock) : void {}
     
     weaveSetSpeed(node : InterfaceAST.SetSpeed) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:152:60
     }
     
     weaveSetClock(node : InterfaceAST.SetClock) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitSetClock(node as unknown as ClassAST.SetClock); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:155:56
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitSetClock(node as unknown as ClassAST.SetClock); }
     }
     
-    weaveSetSpeed(node : InterfaceAST.SetSpeed) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitSetSpeed(node as unknown as ClassAST.SetSpeed); }
-    }
+    weaveSetSpeed(node : InterfaceAST.SetSpeed) : void {}
     
     weaveVariableDec(node : InterfaceAST.VariableDec) : void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:156:60
     }
     
     weaveSetSpeed(node : InterfaceAST.SetSpeed) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitSetSpeed(node as unknown as ClassAST.SetSpeed); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:159:62
         (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitSetSpeed(node as unknown as ClassAST.SetSpeed); }
     }
     
-    weaveVariableDec(node : InterfaceAST.VariableDec) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitVariableDec(node as unknown as ClassAST.VariableDec); }
-    }
+    weaveVariableDec(node : InterfaceAST.VariableDec) : void {}
     
 }

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:160:60
     }
     
     weaveVariableDec(node : InterfaceAST.VariableDec) : void {
-        (<any> node).accept = (visitor: RobotMlVisitor) => { return visitor.visitVariableDec(node as unknown as ClassAST.VariableDec); }
+        (<any> node).accept = (visitor: RobotMlVisitor) => {}
     }
     
