[Killed] BlockStatement
src/semantics/robot-ml-visitor.ts:50:58
 
     protected validationAccept: ValidationAcceptor = () => {};
 
-    visitRoot(node: RobotML, accept: ValidationAcceptor) {
-        this.validationAccept = accept;
-        node.accept(this);
-    }
+    visitRoot(node: RobotML, accept: ValidationAcceptor) {}
     
     abstract visitArgumentDec(node : ArgumentDec) : any;
killedBy: Parsing tests should fail on empty input
statusReason: expected +0 to equal 1

[Killed] BlockStatement
src/semantics/robot-ml-visitor.ts:90:123
  * @param visitor - The visitor to register.
  * @param services - The Langium services.
  */
-export function registerVisitorAsValidator<T extends RobotMlValidationVisitor>(visitor: T, services: LangiumCoreServices) {
-    const registry = services.validation.ValidationRegistry;
-    const checks: ValidationChecks<ASTInterfaces.RobotMlAstType> = {
-        RobotML: (node, accept) => {
-            visitor.visitRoot(node as RobotML, accept);
-        }
-    };
-    registry.register(checks, visitor);
-}
+export function registerVisitorAsValidator<T extends RobotMlValidationVisitor>(visitor: T, services: LangiumCoreServices) {}
 
 
killedBy: Parsing tests should fail on empty input
statusReason: expected +0 to equal 1

[Killed] BlockStatement
src/semantics/robot-ml-visitor.ts:93:36
 export function registerVisitorAsValidator<T extends RobotMlValidationVisitor>(visitor: T, services: LangiumCoreServices) {
     const registry = services.validation.ValidationRegistry;
     const checks: ValidationChecks<ASTInterfaces.RobotMlAstType> = {
-        RobotML: (node, accept) => {
-            visitor.visitRoot(node as RobotML, accept);
-        }
+        RobotML: (node, accept) => {}
     };
     registry.register(checks, visitor);
killedBy: Parsing tests should fail on empty input
statusReason: expected +0 to equal 1

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:111:54
     accept: (visitor: RobotMlVisitor) => any;
 }
 
-function isAcceptor(node: unknown): node is Acceptor {
-    return typeof (node as any).accept === 'function';
-}
+function isAcceptor(node: unknown): node is Acceptor {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:112:12
 }
 
 function isAcceptor(node: unknown): node is Acceptor {
-    return typeof (node as any).accept === 'function';
+    return false;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:112:12
 }
 
 function isAcceptor(node: unknown): node is Acceptor {
-    return typeof (node as any).accept === 'function';
+    return true;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:121:67
     type: Type;
 }
 
-export function isArgumentDec(node: unknown): node is ArgumentDec {
-    return ASTInterfaces.isArgumentDec(node) && isAcceptor(node);
-}
+export function isArgumentDec(node: unknown): node is ArgumentDec {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:122:12
 }
 
 export function isArgumentDec(node: unknown): node is ArgumentDec {
-    return ASTInterfaces.isArgumentDec(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:122:12
 }
 
 export function isArgumentDec(node: unknown): node is ArgumentDec {
-    return ASTInterfaces.isArgumentDec(node) && isAcceptor(node);
+    return ASTInterfaces.isArgumentDec(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:128:65
 
 export type Expression = Acceptor & ASTInterfaces.Expression
 
-export function isExpression(node: unknown): node is Expression {
-    return ASTInterfaces.isExpression(node) && isAcceptor(node);
-}
+export function isExpression(node: unknown): node is Expression {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:129:12
 export type Expression = Acceptor & ASTInterfaces.Expression
 
 export function isExpression(node: unknown): node is Expression {
-    return ASTInterfaces.isExpression(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:129:12
 export type Expression = Acceptor & ASTInterfaces.Expression
 
 export function isExpression(node: unknown): node is Expression {
-    return ASTInterfaces.isExpression(node) && isAcceptor(node);
+    return ASTInterfaces.isExpression(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:138:69
     parameters: Array<Expression>;
 }
 
-export function isFunctionCall(node: unknown): node is FunctionCall {
-    return ASTInterfaces.isFunctionCall(node) && isAcceptor(node);
-}
+export function isFunctionCall(node: unknown): node is FunctionCall {}
 
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:139:12
 }
 
 export function isFunctionCall(node: unknown): node is FunctionCall {
-    return ASTInterfaces.isFunctionCall(node) && isAcceptor(node);
+    return ASTInterfaces.isFunctionCall(node) || isAcceptor(node);
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:139:12
 }
 
 export function isFunctionCall(node: unknown): node is FunctionCall {
-    return ASTInterfaces.isFunctionCall(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:145:61
 
 export type GetClock = Acceptor & ASTInterfaces.GetClock
 
-export function isGetClock(node: unknown): node is GetClock {
-    return ASTInterfaces.isGetClock(node) && isAcceptor(node);
-}
+export function isGetClock(node: unknown): node is GetClock {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:146:12
 export type GetClock = Acceptor & ASTInterfaces.GetClock
 
 export function isGetClock(node: unknown): node is GetClock {
-    return ASTInterfaces.isGetClock(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:146:12
 export type GetClock = Acceptor & ASTInterfaces.GetClock
 
 export function isGetClock(node: unknown): node is GetClock {
-    return ASTInterfaces.isGetClock(node) && isAcceptor(node);
+    return ASTInterfaces.isGetClock(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:154:63
     sensor: Sensor;
 }
 
-export function isGetSensor(node: unknown): node is GetSensor {
-    return ASTInterfaces.isGetSensor(node) && isAcceptor(node);
-}
+export function isGetSensor(node: unknown): node is GetSensor {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:155:12
 }
 
 export function isGetSensor(node: unknown): node is GetSensor {
-    return ASTInterfaces.isGetSensor(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:155:12
 }
 
 export function isGetSensor(node: unknown): node is GetSensor {
-    return ASTInterfaces.isGetSensor(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:161:61
 
 export type GetSpeed = Acceptor & ASTInterfaces.GetSpeed
 
-export function isGetSpeed(node: unknown): node is GetSpeed {
-    return ASTInterfaces.isGetSpeed(node) && isAcceptor(node);
-}
+export function isGetSpeed(node: unknown): node is GetSpeed {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:162:12
 export type GetSpeed = Acceptor & ASTInterfaces.GetSpeed
 
 export function isGetSpeed(node: unknown): node is GetSpeed {
-    return ASTInterfaces.isGetSpeed(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:162:12
 export type GetSpeed = Acceptor & ASTInterfaces.GetSpeed
 
 export function isGetSpeed(node: unknown): node is GetSpeed {
-    return ASTInterfaces.isGetSpeed(node) && isAcceptor(node);
+    return ASTInterfaces.isGetSpeed(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:168:59
 
 export type Literal = Acceptor & ASTInterfaces.Literal
 
-export function isLiteral(node: unknown): node is Literal {
-    return ASTInterfaces.isLiteral(node) && isAcceptor(node);
-}
+export function isLiteral(node: unknown): node is Literal {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:169:12
 export type Literal = Acceptor & ASTInterfaces.Literal
 
 export function isLiteral(node: unknown): node is Literal {
-    return ASTInterfaces.isLiteral(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:169:12
 export type Literal = Acceptor & ASTInterfaces.Literal
 
 export function isLiteral(node: unknown): node is Literal {
-    return ASTInterfaces.isLiteral(node) && isAcceptor(node);
+    return ASTInterfaces.isLiteral(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:177:55
     expr: Expression;
 }
 
-export function isUnary(node: unknown): node is Unary {
-    return ASTInterfaces.isUnary(node) && isAcceptor(node);
-}
+export function isUnary(node: unknown): node is Unary {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:178:12
 }
 
 export function isUnary(node: unknown): node is Unary {
-    return ASTInterfaces.isUnary(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:178:12
 }
 
 export function isUnary(node: unknown): node is Unary {
-    return ASTInterfaces.isUnary(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:187:67
     ref: Reference<Declaration>;
 }
 
-export function isVariableRef(node: unknown): node is VariableRef {
-    return ASTInterfaces.isVariableRef(node) && isAcceptor(node);
-}
+export function isVariableRef(node: unknown): node is VariableRef {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:188:12
 }
 
 export function isVariableRef(node: unknown): node is VariableRef {
-    return ASTInterfaces.isVariableRef(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:188:12
 }
 
 export function isVariableRef(node: unknown): node is VariableRef {
-    return ASTInterfaces.isVariableRef(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:196:59
     functions: Array<FunctionDeclaration>;
 }
 
-export function isRobotML(node: unknown): node is RobotML {
-    return ASTInterfaces.isRobotML(node) && isAcceptor(node);
-}
+export function isRobotML(node: unknown): node is RobotML {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:197:12
 }
 
 export function isRobotML(node: unknown): node is RobotML {
-    return ASTInterfaces.isRobotML(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:197:12
 }
 
 export function isRobotML(node: unknown): node is RobotML {
-    return ASTInterfaces.isRobotML(node) && isAcceptor(node);
+    return ASTInterfaces.isRobotML(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:203:63
 
 export type Statement = Acceptor & ASTInterfaces.Statement
 
-export function isStatement(node: unknown): node is Statement {
-    return ASTInterfaces.isStatement(node) && isAcceptor(node);
-}
+export function isStatement(node: unknown): node is Statement {}
 
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:204:12
 export type Statement = Acceptor & ASTInterfaces.Statement
 
 export function isStatement(node: unknown): node is Statement {
-    return ASTInterfaces.isStatement(node) && isAcceptor(node);
+    return ASTInterfaces.isStatement(node) || isAcceptor(node);
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:204:12
 export type Statement = Acceptor & ASTInterfaces.Statement
 
 export function isStatement(node: unknown): node is Statement {
-    return ASTInterfaces.isStatement(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:213:67
     expression: Expression;
 }
 
-export function isAssignation(node: unknown): node is Assignation {
-    return ASTInterfaces.isAssignation(node) && isAcceptor(node);
-}
+export function isAssignation(node: unknown): node is Assignation {}
 
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:214:12
 }
 
 export function isAssignation(node: unknown): node is Assignation {
-    return ASTInterfaces.isAssignation(node) && isAcceptor(node);
+    return ASTInterfaces.isAssignation(node) || isAcceptor(node);
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:214:12
 }
 
 export function isAssignation(node: unknown): node is Assignation {
-    return ASTInterfaces.isAssignation(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:223:55
     statements: Array<Statement>;
 }
 
-export function isBlock(node: unknown): node is Block {
-    return ASTInterfaces.isBlock(node) && isAcceptor(node);
-}
+export function isBlock(node: unknown): node is Block {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:224:12
 }
 
 export function isBlock(node: unknown): node is Block {
-    return ASTInterfaces.isBlock(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:224:12
 }
 
 export function isBlock(node: unknown): node is Block {
-    return ASTInterfaces.isBlock(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:233:63
     conditions: Array<Expression>;
 }
 
-export function isCondition(node: unknown): node is Condition {
-    return ASTInterfaces.isCondition(node) && isAcceptor(node);
-}
+export function isCondition(node: unknown): node is Condition {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:234:12
 }
 
 export function isCondition(node: unknown): node is Condition {
-    return ASTInterfaces.isCondition(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:234:12
 }
 
 export function isCondition(node: unknown): node is Condition {
-    return ASTInterfaces.isCondition(node) && isAcceptor(node);
+    return ASTInterfaces.isCondition(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:242:61
     expression: Expression;
 }
 
-export function isFnReturn(node: unknown): node is FnReturn {
-    return ASTInterfaces.isFnReturn(node) && isAcceptor(node);
-}
+export function isFnReturn(node: unknown): node is FnReturn {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:243:12
 }
 
 export function isFnReturn(node: unknown): node is FnReturn {
-    return ASTInterfaces.isFnReturn(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:243:12
 }
 
 export function isFnReturn(node: unknown): node is FnReturn {
-    return ASTInterfaces.isFnReturn(node) && isAcceptor(node);
+    return ASTInterfaces.isFnReturn(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:254:83
     parameters: Array<ArgumentDec>;
 }
 
-export function isFunctionDeclaration(node: unknown): node is FunctionDeclaration {
-    return ASTInterfaces.isFunctionDeclaration(node) && isAcceptor(node);
-}
+export function isFunctionDeclaration(node: unknown): node is FunctionDeclaration {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:255:12
 }
 
 export function isFunctionDeclaration(node: unknown): node is FunctionDeclaration {
-    return ASTInterfaces.isFunctionDeclaration(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:255:12
 }
 
 export function isFunctionDeclaration(node: unknown): node is FunctionDeclaration {
-    return ASTInterfaces.isFunctionDeclaration(node) && isAcceptor(node);
+    return ASTInterfaces.isFunctionDeclaration(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:264:53
     block: Block;
 }
 
-export function isLoop(node: unknown): node is Loop {
-    return ASTInterfaces.isLoop(node) && isAcceptor(node);
-}
+export function isLoop(node: unknown): node is Loop {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:265:12
 }
 
 export function isLoop(node: unknown): node is Loop {
-    return ASTInterfaces.isLoop(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:265:12
 }
 
 export function isLoop(node: unknown): node is Loop {
-    return ASTInterfaces.isLoop(node) && isAcceptor(node);
+    return ASTInterfaces.isLoop(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:273:61
     expression: Expression;
 }
 
-export function isMovement(node: unknown): node is Movement {
-    return ASTInterfaces.isMovement(node) && isAcceptor(node);
-}
+export function isMovement(node: unknown): node is Movement {}
 
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:274:12
 }
 
 export function isMovement(node: unknown): node is Movement {
-    return ASTInterfaces.isMovement(node) && isAcceptor(node);
+    return ASTInterfaces.isMovement(node) || isAcceptor(node);
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:274:12
 }
 
 export function isMovement(node: unknown): node is Movement {
-    return ASTInterfaces.isMovement(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:282:61
     expression: Expression;
 }
 
-export function isBackward(node: unknown): node is Backward {
-    return ASTInterfaces.isBackward(node) && isAcceptor(node);
-}
+export function isBackward(node: unknown): node is Backward {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:283:12
 }
 
 export function isBackward(node: unknown): node is Backward {
-    return ASTInterfaces.isBackward(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:283:12
 }
 
 export function isBackward(node: unknown): node is Backward {
-    return ASTInterfaces.isBackward(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:291:59
     expression: Expression;
 }
 
-export function isForward(node: unknown): node is Forward {
-    return ASTInterfaces.isForward(node) && isAcceptor(node);
-}
+export function isForward(node: unknown): node is Forward {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:292:12
 }
 
 export function isForward(node: unknown): node is Forward {
-    return ASTInterfaces.isForward(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:292:12
 }
 
 export function isForward(node: unknown): node is Forward {
-    return ASTInterfaces.isForward(node) && isAcceptor(node);
+    return ASTInterfaces.isForward(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:300:61
     expression: Expression;
 }
 
-export function isLeftward(node: unknown): node is Leftward {
-    return ASTInterfaces.isLeftward(node) && isAcceptor(node);
-}
+export function isLeftward(node: unknown): node is Leftward {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:301:12
 }
 
 export function isLeftward(node: unknown): node is Leftward {
-    return ASTInterfaces.isLeftward(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:301:12
 }
 
 export function isLeftward(node: unknown): node is Leftward {
-    return ASTInterfaces.isLeftward(node) && isAcceptor(node);
+    return ASTInterfaces.isLeftward(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:309:63
     expression: Expression;
 }
 
-export function isRightward(node: unknown): node is Rightward {
-    return ASTInterfaces.isRightward(node) && isAcceptor(node);
-}
+export function isRightward(node: unknown): node is Rightward {}
 
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:310:12
 }
 
 export function isRightward(node: unknown): node is Rightward {
-    return ASTInterfaces.isRightward(node) && isAcceptor(node);
+    return ASTInterfaces.isRightward(node) || isAcceptor(node);
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:310:12
 }
 
 export function isRightward(node: unknown): node is Rightward {
-    return ASTInterfaces.isRightward(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:318:57
     expression: Expression;
 }
 
-export function isRotate(node: unknown): node is Rotate {
-    return ASTInterfaces.isRotate(node) && isAcceptor(node);
-}
+export function isRotate(node: unknown): node is Rotate {}
 
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:319:12
 }
 
 export function isRotate(node: unknown): node is Rotate {
-    return ASTInterfaces.isRotate(node) && isAcceptor(node);
+    return ASTInterfaces.isRotate(node) || isAcceptor(node);
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:319:12
 }
 
 export function isRotate(node: unknown): node is Rotate {
-    return ASTInterfaces.isRotate(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:327:61
     expression: Expression;
 }
 
-export function isSetClock(node: unknown): node is SetClock {
-    return ASTInterfaces.isSetClock(node) && isAcceptor(node);
-}
+export function isSetClock(node: unknown): node is SetClock {}
 
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:328:12
 }
 
 export function isSetClock(node: unknown): node is SetClock {
-    return ASTInterfaces.isSetClock(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:328:12
 }
 
 export function isSetClock(node: unknown): node is SetClock {
-    return ASTInterfaces.isSetClock(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:336:61
     expression: Expression;
 }
 
-export function isSetSpeed(node: unknown): node is SetSpeed {
-    return ASTInterfaces.isSetSpeed(node) && isAcceptor(node);
-}
+export function isSetSpeed(node: unknown): node is SetSpeed {}
 
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:337:12
 }
 
 export function isSetSpeed(node: unknown): node is SetSpeed {
-    return ASTInterfaces.isSetSpeed(node) && isAcceptor(node);
+    return ASTInterfaces.isSetSpeed(node) || isAcceptor(node);
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:337:12
 }
 
 export function isSetSpeed(node: unknown): node is SetSpeed {
-    return ASTInterfaces.isSetSpeed(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:346:67
     expression: Expression;
 }
 
-export function isVariableDec(node: unknown): node is VariableDec {
-    return ASTInterfaces.isVariableDec(node) && isAcceptor(node);
-}
+export function isVariableDec(node: unknown): node is VariableDec {}
 
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:347:12
 }
 
 export function isVariableDec(node: unknown): node is VariableDec {
-    return ASTInterfaces.isVariableDec(node) && isAcceptor(node);
+    return ASTInterfaces.isVariableDec(node) || isAcceptor(node);
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:347:12
 }
 
 export function isVariableDec(node: unknown): node is VariableDec {
-    return ASTInterfaces.isVariableDec(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:360:61
 
 export type Builtins = GetSpeed | GetClock | GetSensor;
 
-export function isBuiltins(node: unknown): node is Builtins {
-    return ASTInterfaces.isBuiltins(node) && isAcceptor(node);
-}
+export function isBuiltins(node: unknown): node is Builtins {}
 
 export type Declaration = VariableDec | ArgumentDec;

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:361:12
 export type Builtins = GetSpeed | GetClock | GetSensor;
 
 export function isBuiltins(node: unknown): node is Builtins {
-    return ASTInterfaces.isBuiltins(node) && isAcceptor(node);
+    return ASTInterfaces.isBuiltins(node) || isAcceptor(node);
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:361:12
 export type Builtins = GetSpeed | GetClock | GetSensor;
 
 export function isBuiltins(node: unknown): node is Builtins {
-    return ASTInterfaces.isBuiltins(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:366:67
 
 export type Declaration = VariableDec | ArgumentDec;
 
-export function isDeclaration(node: unknown): node is Declaration {
-    return ASTInterfaces.isDeclaration(node) && isAcceptor(node);
-}
+export function isDeclaration(node: unknown): node is Declaration {}
 
 export type PrimaryExpression = VariableRef | FunctionCall | Builtins | Literal;

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:367:12
 export type Declaration = VariableDec | ArgumentDec;
 
 export function isDeclaration(node: unknown): node is Declaration {
-    return ASTInterfaces.isDeclaration(node) && isAcceptor(node);
+    return false;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:367:12
 export type Declaration = VariableDec | ArgumentDec;
 
 export function isDeclaration(node: unknown): node is Declaration {
-    return ASTInterfaces.isDeclaration(node) && isAcceptor(node);
+    return ASTInterfaces.isDeclaration(node) || isAcceptor(node);
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:372:79
 
 export type PrimaryExpression = VariableRef | FunctionCall | Builtins | Literal;
 
-export function isPrimaryExpression(node: unknown): node is PrimaryExpression {
-    return ASTInterfaces.isPrimaryExpression(node) && isAcceptor(node);
-}
+export function isPrimaryExpression(node: unknown): node is PrimaryExpression {}
 
 export type Sensor = 'Distance' | 'Color';

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:373:12
 export type PrimaryExpression = VariableRef | FunctionCall | Builtins | Literal;
 
 export function isPrimaryExpression(node: unknown): node is PrimaryExpression {
-    return ASTInterfaces.isPrimaryExpression(node) && isAcceptor(node);
+    return true;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:373:12
 export type PrimaryExpression = VariableRef | FunctionCall | Builtins | Literal;
 
 export function isPrimaryExpression(node: unknown): node is PrimaryExpression {
-    return ASTInterfaces.isPrimaryExpression(node) && isAcceptor(node);
+    return false;
 }
 
