[Survived] ArrowFunction
src/robot-ml-module.ts:51:21
 	PartialLangiumServices & RobotMlAddedServices
 > = {
 	validation: {
-		RobotMlValidator: () => new RobotMlValidator(),
+		RobotMlValidator: () => undefined,
 	},
 	references: {

[Killed] ArrowFunction
src/robot-ml-module.ts:57:24
 		// ScopeProvider: (services) => new MyLanguageScopeProvider(services)
 	},
 	visitors: {
-		RobotMlAcceptWeaver: (services) => new RobotMlAcceptWeaver(services),
+		RobotMlAcceptWeaver: () => undefined,
 		RobotMLTypeCheckVisitor: () => new RobotMLTypeCheckVisitor(),
 		RobotMLAstPrinterVisitor: () => new RobotMLAstPrinterVisitor(),
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] ArrowFunction
src/robot-ml-module.ts:58:28
 	},
 	visitors: {
 		RobotMlAcceptWeaver: (services) => new RobotMlAcceptWeaver(services),
-		RobotMLTypeCheckVisitor: () => new RobotMLTypeCheckVisitor(),
+		RobotMLTypeCheckVisitor: () => undefined,
 		RobotMLAstPrinterVisitor: () => new RobotMLAstPrinterVisitor(),
 	},
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Survived] ArrowFunction
src/robot-ml-module.ts:59:29
 	visitors: {
 		RobotMlAcceptWeaver: (services) => new RobotMlAcceptWeaver(services),
 		RobotMLTypeCheckVisitor: () => new RobotMLTypeCheckVisitor(),
-		RobotMLAstPrinterVisitor: () => new RobotMLAstPrinterVisitor(),
+		RobotMLAstPrinterVisitor: () => undefined,
 	},
 };

[Killed] BlockStatement
src/robot-ml-module.ts:81:3
 export function createRobotMlServices(context: DefaultSharedModuleContext): {
 	shared: LangiumSharedServices;
 	RobotMl: RobotMlServices;
-} {
-	const shared = inject(
-		createDefaultSharedModule(context),
-		RobotMlGeneratedSharedModule,
-	);
-	const RobotMl = inject(
-		createDefaultModule({ shared }),
-		RobotMlGeneratedModule,
-		RobotMlModule,
-	);
-	shared.ServiceRegistry.register(RobotMl);
-	RobotMl.visitors.RobotMlAcceptWeaver;
-	registerVisitorAsValidator(RobotMl.visitors.RobotMLTypeCheckVisitor, RobotMl); // This is to register the validation visitor to the validation registry of Langium
-	registerValidationChecks(RobotMl);
-	if (!context.connection) {
-		// We don't run inside a language server
-		// Therefore, initialize the configuration provider instantly
-		shared.workspace.ConfigurationProvider.initialized({});
-	}
-	return { shared, RobotMl };
-}
+} {}
 
killedBy: Parsing tests should fail on empty input
statusReason: Cannot read properties of undefined (reading 'RobotMl')

[Survived] BlockStatement
src/robot-ml-module.ts:95:27
 	RobotMl.visitors.RobotMlAcceptWeaver;
 	registerVisitorAsValidator(RobotMl.visitors.RobotMLTypeCheckVisitor, RobotMl); // This is to register the validation visitor to the validation registry of Langium
 	registerValidationChecks(RobotMl);
-	if (!context.connection) {
-		// We don't run inside a language server
-		// Therefore, initialize the configuration provider instantly
-		shared.workspace.ConfigurationProvider.initialized({});
-	}
+	if (!context.connection) {}
 	return { shared, RobotMl };
 }

[Survived] ConditionalExpression
src/robot-ml-module.ts:95:6
 	RobotMl.visitors.RobotMlAcceptWeaver;
 	registerVisitorAsValidator(RobotMl.visitors.RobotMLTypeCheckVisitor, RobotMl); // This is to register the validation visitor to the validation registry of Langium
 	registerValidationChecks(RobotMl);
-	if (!context.connection) {
+	if (false) {
 		// We don't run inside a language server
 		// Therefore, initialize the configuration provider instantly
