[Survived] BlockStatement
src/robot-ml-validator.ts:8:69
 /**
  * Register custom validation checks.
  */
-export function registerValidationChecks(services: RobotMlServices) {
-	const registry = services.validation.ValidationRegistry;
-	const validator = services.validation.RobotMlValidator;
-	const checks: ValidationChecks<RobotMlAstType> = {
-		// TODO: Declare validators for your properties
-		// See doc : https://langium.org/docs/learn/workflow/create_validations/
-		/*
-        Element: validator.checkElement
-        */
-	};
-	registry.register(checks, validator);
-}
+export function registerValidationChecks(services: RobotMlServices) {}
 
 /**
