[Killed] ArrowFunction
src/generated/module.ts:18:20
 } as const satisfies LanguageMetaData;
 
 export const RobotMlGeneratedSharedModule: Module<LangiumSharedCoreServices, LangiumGeneratedSharedCoreServices> = {
-    AstReflection: () => new RobotMlAstReflection()
+    AstReflection: () => undefined
 };
 
killedBy: Parsing tests should fail on empty input
statusReason: Cannot read properties of undefined (reading 'getAllSubTypes')

[Killed] ArrowFunction
src/generated/module.ts:22:14
 };
 
 export const RobotMlGeneratedModule: Module<LangiumCoreServices, LangiumGeneratedCoreServices> = {
-    Grammar: () => RobotMlGrammar(),
+    Grammar: () => undefined,
     LanguageMetaData: () => RobotMlLanguageMetaData,
     parser: {}
killedBy: Parsing tests should fail on empty input
statusReason: Cannot read properties of undefined (reading 'rules')

[Killed] ArrowFunction
src/generated/module.ts:23:23
 
 export const RobotMlGeneratedModule: Module<LangiumCoreServices, LangiumGeneratedCoreServices> = {
     Grammar: () => RobotMlGrammar(),
-    LanguageMetaData: () => RobotMlLanguageMetaData,
+    LanguageMetaData: () => undefined,
     parser: {}
 };
killedBy: Parsing tests should fail on empty input
statusReason: Cannot read properties of undefined (reading 'fileExtensions')
