[Survived] Regex
src/generated/ast.ts:10:9
 import * as langium from "langium";
 
 export const RobotMlTerminals = {
-	FLOAT: /[0-9]+\.[0-9]+([eE][+-]?[0-9]+)?/,
+	FLOAT: /[^0-9]+\.[0-9]+([eE][+-]?[0-9]+)?/,
 	BOOL: /true|false/,
 	ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,

[Survived] Regex
src/generated/ast.ts:10:9
 import * as langium from "langium";
 
 export const RobotMlTerminals = {
-	FLOAT: /[0-9]+\.[0-9]+([eE][+-]?[0-9]+)?/,
+	FLOAT: /[0-9]+\.[0-9]+([eE][^+-]?[0-9]+)?/,
 	BOOL: /true|false/,
 	ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,

[Survived] Regex
src/generated/ast.ts:12:6
 export const RobotMlTerminals = {
 	FLOAT: /[0-9]+\.[0-9]+([eE][+-]?[0-9]+)?/,
 	BOOL: /true|false/,
-	ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,
+	ID: /\^([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,
 	INT: /[0-9]+/,
 	STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,

[Survived] Regex
src/generated/ast.ts:12:6
 export const RobotMlTerminals = {
 	FLOAT: /[0-9]+\.[0-9]+([eE][+-]?[0-9]+)?/,
 	BOOL: /true|false/,
-	ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,
+	ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9])*/,
 	INT: /[0-9]+/,
 	STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,

[Survived] Regex
src/generated/ast.ts:13:7
 	FLOAT: /[0-9]+\.[0-9]+([eE][+-]?[0-9]+)?/,
 	BOOL: /true|false/,
 	ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,
-	INT: /[0-9]+/,
+	INT: /[0-9]/,
 	STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,
 	WS: /\s+/,

[Survived] Regex
src/generated/ast.ts:14:10
 	BOOL: /true|false/,
 	ID: /\^?([a-z]+|[A-Z]+|_)([a-z]+|[A-Z]+|_|[0-9]+)*/,
 	INT: /[0-9]+/,
-	STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))*'/,
+	STRING: /"(\\(?:[\s\S])|(?:(?!(\\|"))[\s\S]*?))*"|'(\\(?:[\s\S])|(?:(?!(\\|'))[\s\S]*?))'/,
 	WS: /\s+/,
 	ML_COMMENT: /\/\*[\s\S]*?\*\//,
