[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:204:11
 							throw "Error";
 						}
 
-						if (checkNumber1) {
+						if (true) {
 							return { type: "float" };
 						} else {
killedBy: Parsing tests math
statusReason: expected 1 to equal +0

[Killed] ConditionalExpression
src/robot-ml-typecheck.ts:328:4
 		const { type } = this.visitExpression(node.expr);
 
 		const check =
-			(node.op === "!" && type === "boolean") ||
-			(node.op === "-" && (type === "integer" || type === "float"));
+			false;
 
 		if (!check) {
killedBy: Parsing tests builtins
statusReason: expected 1 to equal +0

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:329:25
 
 		const check =
 			(node.op === "!" && type === "boolean") ||
-			(node.op === "-" && (type === "integer" || type === "float"));
+			(node.op === "-" && (type !== "integer" || type === "float"));
 
 		if (!check) {
killedBy: Parsing tests builtins
statusReason: expected 1 to equal +0

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:329:5
 
 		const check =
 			(node.op === "!" && type === "boolean") ||
-			(node.op === "-" && (type === "integer" || type === "float"));
+			(node.op !== "-" && (type === "integer" || type === "float"));
 
 		if (!check) {
killedBy: Parsing tests builtins
statusReason: expected 1 to equal +0

[Killed] EqualityOperator
src/robot-ml-typecheck.ts:598:8
 			if (!node.type) {
 				node.type = type;
 			}
-			if (node.type !== type) {
+			if (node.type === type) {
 				this.validationAccept(
 					"error",
killedBy: Parsing tests builtins
statusReason: expected 4 to equal +0
