[Killed] BooleanLiteral
src/semantics/robot-ml-accept-weaver.ts:62:6
 			DocumentState.IndexedReferences,
 			(document) => {
 				if (
-					!document.diagnostics ||
+					document.diagnostics ||
 					document.diagnostics.filter(
 						(d) =>
killedBy: Parsing tests should fail on empty input
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
src/semantics/robot-ml-accept-weaver.ts:62:6
 			DocumentState.IndexedReferences,
 			(document) => {
 				if (
-					!document.diagnostics ||
-					document.diagnostics.filter(
-						(d) =>
-							d.severity ===
-							DiagnosticSeverity.Error,
-					).length === 0
+					false
 				) {
 					AstUtils.streamAst(
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[NoCoverage] MethodExpression
src/semantics/robot-ml-accept-weaver.ts:63:6
 			(document) => {
 				if (
 					!document.diagnostics ||
-					document.diagnostics.filter(
-						(d) =>
-							d.severity ===
-							DiagnosticSeverity.Error,
-					).length === 0
+					document.diagnostics.length === 0
 				) {
 					AstUtils.streamAst(

[NoCoverage] EqualityOperator
src/semantics/robot-ml-accept-weaver.ts:63:6
 			(document) => {
 				if (
 					!document.diagnostics ||
-					document.diagnostics.filter(
-						(d) =>
-							d.severity ===
-							DiagnosticSeverity.Error,
-					).length === 0
+					document.diagnostics.filter(d => d.severity === DiagnosticSeverity.Error).length !== 0
 				) {
 					AstUtils.streamAst(

[NoCoverage] ArrowFunction
src/semantics/robot-ml-accept-weaver.ts:64:7
 				if (
 					!document.diagnostics ||
 					document.diagnostics.filter(
-						(d) =>
-							d.severity ===
-							DiagnosticSeverity.Error,
+						() => undefined,
 					).length === 0
 				) {

[NoCoverage] EqualityOperator
src/semantics/robot-ml-accept-weaver.ts:65:8
 					!document.diagnostics ||
 					document.diagnostics.filter(
 						(d) =>
-							d.severity ===
-							DiagnosticSeverity.Error,
+							d.severity !== DiagnosticSeverity.Error,
 					).length === 0
 				) {

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-accept-weaver.ts:65:8
 					!document.diagnostics ||
 					document.diagnostics.filter(
 						(d) =>
-							d.severity ===
-							DiagnosticSeverity.Error,
+							true,
 					).length === 0
 				) {

[Killed] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:68:7
 							d.severity ===
 							DiagnosticSeverity.Error,
 					).length === 0
-				) {
-					AstUtils.streamAst(
-						document.parseResult.value,
-					).forEach((node: AstNode) => {
-						if (!this.cache.has(node, "weaved")) {
-							const nodeType =
-								node.$type as keyof Weaver;
-							const weaveFunction =
-								this.checks[nodeType];
-							if (weaveFunction) {
-								weaveFunction(
-									node as any,
-								);
-								this.cache.set(
-									node,
-									"weaved",
-									undefined,
-								);
-							}
-						}
-					});
-				}
+				) {}
 			},
 		);
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:71:35
 				) {
 					AstUtils.streamAst(
 						document.parseResult.value,
-					).forEach((node: AstNode) => {
-						if (!this.cache.has(node, "weaved")) {
-							const nodeType =
-								node.$type as keyof Weaver;
-							const weaveFunction =
-								this.checks[nodeType];
-							if (weaveFunction) {
-								weaveFunction(
-									node as any,
-								);
-								this.cache.set(
-									node,
-									"weaved",
-									undefined,
-								);
-							}
-						}
-					});
+					).forEach((node: AstNode) => {});
 				}
 			},
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] BooleanLiteral
src/semantics/robot-ml-accept-weaver.ts:72:11
 					AstUtils.streamAst(
 						document.parseResult.value,
 					).forEach((node: AstNode) => {
-						if (!this.cache.has(node, "weaved")) {
+						if (this.cache.has(node, "weaved")) {
 							const nodeType =
 								node.$type as keyof Weaver;
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] ConditionalExpression
src/semantics/robot-ml-accept-weaver.ts:72:11
 					AstUtils.streamAst(
 						document.parseResult.value,
 					).forEach((node: AstNode) => {
-						if (!this.cache.has(node, "weaved")) {
+						if (false) {
 							const nodeType =
 								node.$type as keyof Weaver;
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] ConditionalExpression
src/semantics/robot-ml-accept-weaver.ts:77:12
 								node.$type as keyof Weaver;
 							const weaveFunction =
 								this.checks[nodeType];
-							if (weaveFunction) {
+							if (true) {
 								weaveFunction(
 									node as any,
killedBy: Parsing tests Add an int to a float
statusReason: weaveFunction is not a function

[Killed] ConditionalExpression
src/semantics/robot-ml-accept-weaver.ts:77:12
 								node.$type as keyof Weaver;
 							const weaveFunction =
 								this.checks[nodeType];
-							if (weaveFunction) {
+							if (false) {
 								weaveFunction(
 									node as any,
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:94:57
 		);
 	}
 
-	weaveArgumentDec(node: InterfaceAST.ArgumentDec): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitArgumentDec(
-				node as unknown as ClassAST.ArgumentDec,
-			);
-		};
-	}
+	weaveArgumentDec(node: InterfaceAST.ArgumentDec): void {}
 
 	weaveFunctionCall(node: InterfaceAST.FunctionCall): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:95:53
 	}
 
 	weaveArgumentDec(node: InterfaceAST.ArgumentDec): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitArgumentDec(
-				node as unknown as ClassAST.ArgumentDec,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:102:59
 		};
 	}
 
-	weaveFunctionCall(node: InterfaceAST.FunctionCall): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitFunctionCall(
-				node as unknown as ClassAST.FunctionCall,
-			);
-		};
-	}
+	weaveFunctionCall(node: InterfaceAST.FunctionCall): void {}
 
 	weaveGetClock(node: InterfaceAST.GetClock): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:103:53
 	}
 
 	weaveFunctionCall(node: InterfaceAST.FunctionCall): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitFunctionCall(
-				node as unknown as ClassAST.FunctionCall,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:110:51
 		};
 	}
 
-	weaveGetClock(node: InterfaceAST.GetClock): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitGetClock(
-				node as unknown as ClassAST.GetClock,
-			);
-		};
-	}
+	weaveGetClock(node: InterfaceAST.GetClock): void {}
 
 	weaveGetSensor(node: InterfaceAST.GetSensor): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:111:53
 	}
 
 	weaveGetClock(node: InterfaceAST.GetClock): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitGetClock(
-				node as unknown as ClassAST.GetClock,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:118:53
 		};
 	}
 
-	weaveGetSensor(node: InterfaceAST.GetSensor): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitGetSensor(
-				node as unknown as ClassAST.GetSensor,
-			);
-		};
-	}
+	weaveGetSensor(node: InterfaceAST.GetSensor): void {}
 
 	weaveGetSpeed(node: InterfaceAST.GetSpeed): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:119:53
 	}
 
 	weaveGetSensor(node: InterfaceAST.GetSensor): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitGetSensor(
-				node as unknown as ClassAST.GetSensor,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:126:51
 		};
 	}
 
-	weaveGetSpeed(node: InterfaceAST.GetSpeed): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitGetSpeed(
-				node as unknown as ClassAST.GetSpeed,
-			);
-		};
-	}
+	weaveGetSpeed(node: InterfaceAST.GetSpeed): void {}
 
 	weaveLiteral(node: InterfaceAST.Literal): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:127:53
 	}
 
 	weaveGetSpeed(node: InterfaceAST.GetSpeed): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitGetSpeed(
-				node as unknown as ClassAST.GetSpeed,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:134:49
 		};
 	}
 
-	weaveLiteral(node: InterfaceAST.Literal): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitLiteral(node as unknown as ClassAST.Literal);
-		};
-	}
+	weaveLiteral(node: InterfaceAST.Literal): void {}
 
 	weaveUnary(node: InterfaceAST.Unary): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:135:53
 	}
 
 	weaveLiteral(node: InterfaceAST.Literal): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitLiteral(node as unknown as ClassAST.Literal);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:140:45
 		};
 	}
 
-	weaveUnary(node: InterfaceAST.Unary): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitUnary(node as unknown as ClassAST.Unary);
-		};
-	}
+	weaveUnary(node: InterfaceAST.Unary): void {}
 
 	weaveVariableRef(node: InterfaceAST.VariableRef): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:141:53
 	}
 
 	weaveUnary(node: InterfaceAST.Unary): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitUnary(node as unknown as ClassAST.Unary);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:146:57
 		};
 	}
 
-	weaveVariableRef(node: InterfaceAST.VariableRef): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitVariableRef(
-				node as unknown as ClassAST.VariableRef,
-			);
-		};
-	}
+	weaveVariableRef(node: InterfaceAST.VariableRef): void {}
 
 	weaveRobotML(node: InterfaceAST.RobotML): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:147:53
 	}
 
 	weaveVariableRef(node: InterfaceAST.VariableRef): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitVariableRef(
-				node as unknown as ClassAST.VariableRef,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Killed] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:154:49
 		};
 	}
 
-	weaveRobotML(node: InterfaceAST.RobotML): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitRobotML(node as unknown as ClassAST.RobotML);
-		};
-	}
+	weaveRobotML(node: InterfaceAST.RobotML): void {}
 
 	weaveAssignation(node: InterfaceAST.Assignation): void {
killedBy: Parsing tests should fail on empty input
statusReason: expected 'An error occurred during validation: …' to equal 'There is no main functions defined'

[Killed] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:155:53
 	}
 
 	weaveRobotML(node: InterfaceAST.RobotML): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitRobotML(node as unknown as ClassAST.RobotML);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 
killedBy: Parsing tests should fail on empty input
statusReason: expected +0 to equal 1

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:160:57
 		};
 	}
 
-	weaveAssignation(node: InterfaceAST.Assignation): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitAssignation(
-				node as unknown as ClassAST.Assignation,
-			);
-		};
-	}
+	weaveAssignation(node: InterfaceAST.Assignation): void {}
 
 	weaveBlock(node: InterfaceAST.Block): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:161:53
 	}
 
 	weaveAssignation(node: InterfaceAST.Assignation): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitAssignation(
-				node as unknown as ClassAST.Assignation,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:168:45
 		};
 	}
 
-	weaveBlock(node: InterfaceAST.Block): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitBlock(node as unknown as ClassAST.Block);
-		};
-	}
+	weaveBlock(node: InterfaceAST.Block): void {}
 
 	weaveCondition(node: InterfaceAST.Condition): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:169:53
 	}
 
 	weaveBlock(node: InterfaceAST.Block): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitBlock(node as unknown as ClassAST.Block);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:174:53
 		};
 	}
 
-	weaveCondition(node: InterfaceAST.Condition): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitCondition(
-				node as unknown as ClassAST.Condition,
-			);
-		};
-	}
+	weaveCondition(node: InterfaceAST.Condition): void {}
 
 	weaveFnReturn(node: InterfaceAST.FnReturn): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:175:53
 	}
 
 	weaveCondition(node: InterfaceAST.Condition): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitCondition(
-				node as unknown as ClassAST.Condition,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:182:51
 		};
 	}
 
-	weaveFnReturn(node: InterfaceAST.FnReturn): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitFnReturn(
-				node as unknown as ClassAST.FnReturn,
-			);
-		};
-	}
+	weaveFnReturn(node: InterfaceAST.FnReturn): void {}
 
 	weaveFunctionDeclaration(node: InterfaceAST.FunctionDeclaration): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:183:53
 	}
 
 	weaveFnReturn(node: InterfaceAST.FnReturn): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitFnReturn(
-				node as unknown as ClassAST.FnReturn,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:190:73
 		};
 	}
 
-	weaveFunctionDeclaration(node: InterfaceAST.FunctionDeclaration): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitFunctionDeclaration(
-				node as unknown as ClassAST.FunctionDeclaration,
-			);
-		};
-	}
+	weaveFunctionDeclaration(node: InterfaceAST.FunctionDeclaration): void {}
 
 	weaveLoop(node: InterfaceAST.Loop): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:191:53
 	}
 
 	weaveFunctionDeclaration(node: InterfaceAST.FunctionDeclaration): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitFunctionDeclaration(
-				node as unknown as ClassAST.FunctionDeclaration,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:198:43
 		};
 	}
 
-	weaveLoop(node: InterfaceAST.Loop): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitLoop(node as unknown as ClassAST.Loop);
-		};
-	}
+	weaveLoop(node: InterfaceAST.Loop): void {}
 
 	weaveBackward(node: InterfaceAST.Backward): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:199:53
 	}
 
 	weaveLoop(node: InterfaceAST.Loop): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitLoop(node as unknown as ClassAST.Loop);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:204:51
 		};
 	}
 
-	weaveBackward(node: InterfaceAST.Backward): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitBackward(
-				node as unknown as ClassAST.Backward,
-			);
-		};
-	}
+	weaveBackward(node: InterfaceAST.Backward): void {}
 
 	weaveForward(node: InterfaceAST.Forward): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:205:53
 	}
 
 	weaveBackward(node: InterfaceAST.Backward): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitBackward(
-				node as unknown as ClassAST.Backward,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:212:49
 		};
 	}
 
-	weaveForward(node: InterfaceAST.Forward): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitForward(node as unknown as ClassAST.Forward);
-		};
-	}
+	weaveForward(node: InterfaceAST.Forward): void {}
 
 	weaveLeftward(node: InterfaceAST.Leftward): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:213:53
 	}
 
 	weaveForward(node: InterfaceAST.Forward): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitForward(node as unknown as ClassAST.Forward);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:218:51
 		};
 	}
 
-	weaveLeftward(node: InterfaceAST.Leftward): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitLeftward(
-				node as unknown as ClassAST.Leftward,
-			);
-		};
-	}
+	weaveLeftward(node: InterfaceAST.Leftward): void {}
 
 	weaveRightward(node: InterfaceAST.Rightward): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:219:53
 	}
 
 	weaveLeftward(node: InterfaceAST.Leftward): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitLeftward(
-				node as unknown as ClassAST.Leftward,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:226:53
 		};
 	}
 
-	weaveRightward(node: InterfaceAST.Rightward): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitRightward(
-				node as unknown as ClassAST.Rightward,
-			);
-		};
-	}
+	weaveRightward(node: InterfaceAST.Rightward): void {}
 
 	weaveRotate(node: InterfaceAST.Rotate): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:227:53
 	}
 
 	weaveRightward(node: InterfaceAST.Rightward): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitRightward(
-				node as unknown as ClassAST.Rightward,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:234:47
 		};
 	}
 
-	weaveRotate(node: InterfaceAST.Rotate): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitRotate(node as unknown as ClassAST.Rotate);
-		};
-	}
+	weaveRotate(node: InterfaceAST.Rotate): void {}
 
 	weaveSetClock(node: InterfaceAST.SetClock): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:235:53
 	}
 
 	weaveRotate(node: InterfaceAST.Rotate): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitRotate(node as unknown as ClassAST.Rotate);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:240:51
 		};
 	}
 
-	weaveSetClock(node: InterfaceAST.SetClock): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitSetClock(
-				node as unknown as ClassAST.SetClock,
-			);
-		};
-	}
+	weaveSetClock(node: InterfaceAST.SetClock): void {}
 
 	weaveSetSpeed(node: InterfaceAST.SetSpeed): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:241:53
 	}
 
 	weaveSetClock(node: InterfaceAST.SetClock): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitSetClock(
-				node as unknown as ClassAST.SetClock,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:248:51
 		};
 	}
 
-	weaveSetSpeed(node: InterfaceAST.SetSpeed): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitSetSpeed(
-				node as unknown as ClassAST.SetSpeed,
-			);
-		};
-	}
+	weaveSetSpeed(node: InterfaceAST.SetSpeed): void {}
 
 	weaveVariableDec(node: InterfaceAST.VariableDec): void {

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:249:53
 	}
 
 	weaveSetSpeed(node: InterfaceAST.SetSpeed): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitSetSpeed(
-				node as unknown as ClassAST.SetSpeed,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 

[Survived] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:256:57
 		};
 	}
 
-	weaveVariableDec(node: InterfaceAST.VariableDec): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitVariableDec(
-				node as unknown as ClassAST.VariableDec,
-			);
-		};
-	}
+	weaveVariableDec(node: InterfaceAST.VariableDec): void {}
 }
 

[NoCoverage] BlockStatement
src/semantics/robot-ml-accept-weaver.ts:257:53
 	}
 
 	weaveVariableDec(node: InterfaceAST.VariableDec): void {
-		(<any>node).accept = (visitor: RobotMlVisitor) => {
-			return visitor.visitVariableDec(
-				node as unknown as ClassAST.VariableDec,
-			);
-		};
+		(<any>node).accept = (visitor: RobotMlVisitor) => {};
 	}
 }
