[Killed] BlockStatement
src/semantics/robot-ml-visitor.ts:96:3
 export function registerVisitorAsValidator<T extends RobotMlValidationVisitor>(
 	visitor: T,
 	services: LangiumCoreServices,
-) {
-	const registry = services.validation.ValidationRegistry;
-	const checks: ValidationChecks<ASTInterfaces.RobotMlAstType> = {
-		RobotML: (node, accept) => {
-			visitor.visitRoot(node as RobotML, accept);
-		},
-	};
-	registry.register(checks, visitor);
-}
+) {}
 
 /* Each concrete interfaces in the `ast.js` file have an equivalent generated type with the same properties but also with an `accept` method.
killedBy: Parsing tests should fail on empty input
statusReason: expected +0 to equal 1

[Killed] ObjectLiteral
src/semantics/robot-ml-visitor.ts:98:65
 	services: LangiumCoreServices,
 ) {
 	const registry = services.validation.ValidationRegistry;
-	const checks: ValidationChecks<ASTInterfaces.RobotMlAstType> = {
-		RobotML: (node, accept) => {
-			visitor.visitRoot(node as RobotML, accept);
-		},
-	};
+	const checks: ValidationChecks<ASTInterfaces.RobotMlAstType> = {};
 	registry.register(checks, visitor);
 }
killedBy: Parsing tests should fail on empty input
statusReason: expected +0 to equal 1

[Killed] BlockStatement
src/semantics/robot-ml-visitor.ts:99:30
 ) {
 	const registry = services.validation.ValidationRegistry;
 	const checks: ValidationChecks<ASTInterfaces.RobotMlAstType> = {
-		RobotML: (node, accept) => {
-			visitor.visitRoot(node as RobotML, accept);
-		},
+		RobotML: (node, accept) => {},
 	};
 	registry.register(checks, visitor);
killedBy: Parsing tests should fail on empty input
statusReason: expected +0 to equal 1

[NoCoverage] BlockStatement
src/semantics/robot-ml-visitor.ts:116:54
 	accept: (visitor: RobotMlVisitor) => any;
 };
 
-function isAcceptor(node: unknown): node is Acceptor {
-	return typeof (node as any).accept === "function";
-}
+function isAcceptor(node: unknown): node is Acceptor {}
 
 export type ArgumentDec = Acceptor &

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:117:9
 };
 
 function isAcceptor(node: unknown): node is Acceptor {
-	return typeof (node as any).accept === "function";
+	return true;
 }
 

[NoCoverage] EqualityOperator
src/semantics/robot-ml-visitor.ts:117:9
 };
 
 function isAcceptor(node: unknown): node is Acceptor {
-	return typeof (node as any).accept === "function";
+	return typeof (node as any).accept !== "function";
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:133:9
 export type Expression = Acceptor & ASTInterfaces.Expression;
 
 export function isExpression(node: unknown): node is Expression {
-	return ASTInterfaces.isExpression(node) && isAcceptor(node);
+	return true;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:149:9
 export type GetClock = Acceptor & ASTInterfaces.GetClock;
 
 export function isGetClock(node: unknown): node is GetClock {
-	return ASTInterfaces.isGetClock(node) && isAcceptor(node);
+	return true;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:158:9
 	};
 
 export function isGetSensor(node: unknown): node is GetSensor {
-	return ASTInterfaces.isGetSensor(node) && isAcceptor(node);
+	return ASTInterfaces.isGetSensor(node) || isAcceptor(node);
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:179:9
 	};
 
 export function isUnary(node: unknown): node is Unary {
-	return ASTInterfaces.isUnary(node) && isAcceptor(node);
+	return ASTInterfaces.isUnary(node) || isAcceptor(node);
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:214:9
 	};
 
 export function isAssignation(node: unknown): node is Assignation {
-	return ASTInterfaces.isAssignation(node) && isAcceptor(node);
+	return false;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:234:9
 	};
 
 export function isCondition(node: unknown): node is Condition {
-	return ASTInterfaces.isCondition(node) && isAcceptor(node);
+	return true;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:243:9
 	};
 
 export function isFnReturn(node: unknown): node is FnReturn {
-	return ASTInterfaces.isFnReturn(node) && isAcceptor(node);
+	return false;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:286:9
 	};
 
 export function isBackward(node: unknown): node is Backward {
-	return ASTInterfaces.isBackward(node) && isAcceptor(node);
+	return ASTInterfaces.isBackward(node) || isAcceptor(node);
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:295:9
 	};
 
 export function isForward(node: unknown): node is Forward {
-	return ASTInterfaces.isForward(node) && isAcceptor(node);
+	return false;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:304:9
 	};
 
 export function isLeftward(node: unknown): node is Leftward {
-	return ASTInterfaces.isLeftward(node) && isAcceptor(node);
+	return true;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:313:9
 	};
 
 export function isRightward(node: unknown): node is Rightward {
-	return ASTInterfaces.isRightward(node) && isAcceptor(node);
+	return true;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:322:9
 	};
 
 export function isRotate(node: unknown): node is Rotate {
-	return ASTInterfaces.isRotate(node) && isAcceptor(node);
+	return false;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:331:9
 	};
 
 export function isSetClock(node: unknown): node is SetClock {
-	return ASTInterfaces.isSetClock(node) && isAcceptor(node);
+	return ASTInterfaces.isSetClock(node) || isAcceptor(node);
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:340:9
 	};
 
 export function isSetSpeed(node: unknown): node is SetSpeed {
-	return ASTInterfaces.isSetSpeed(node) && isAcceptor(node);
+	return true;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:350:9
 	};
 
 export function isVariableDec(node: unknown): node is VariableDec {
-	return ASTInterfaces.isVariableDec(node) && isAcceptor(node);
+	return false;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:377:9
 export type Builtins = GetSpeed | GetClock | GetSensor;
 
 export function isBuiltins(node: unknown): node is Builtins {
-	return ASTInterfaces.isBuiltins(node) && isAcceptor(node);
+	return false;
 }
 

[NoCoverage] ConditionalExpression
src/semantics/robot-ml-visitor.ts:383:9
 export type Declaration = VariableDec | ArgumentDec;
 
 export function isDeclaration(node: unknown): node is Declaration {
-	return ASTInterfaces.isDeclaration(node) && isAcceptor(node);
+	return true;
 }
 

[NoCoverage] LogicalOperator
src/semantics/robot-ml-visitor.ts:389:9
 export type PrimaryExpression = VariableRef | FunctionCall | Builtins | Literal;
 
 export function isPrimaryExpression(node: unknown): node is PrimaryExpression {
-	return ASTInterfaces.isPrimaryExpression(node) && isAcceptor(node);
+	return ASTInterfaces.isPrimaryExpression(node) || isAcceptor(node);
 }
 
