[Killed] ArrowFunction
src/generated/module.ts:28:17
 	LangiumSharedCoreServices,
 	LangiumGeneratedSharedCoreServices
 > = {
-	AstReflection: () => new RobotMlAstReflection(),
+	AstReflection: () => undefined,
 };
 
killedBy: Parsing tests should fail on empty input
statusReason: Cannot read properties of undefined (reading 'getAllSubTypes')

[Killed] ArrowFunction
src/generated/module.ts:35:11
 	LangiumCoreServices,
 	LangiumGeneratedCoreServices
 > = {
-	Grammar: () => RobotMlGrammar(),
+	Grammar: () => undefined,
 	LanguageMetaData: () => RobotMlLanguageMetaData,
 	parser: {},
killedBy: Parsing tests should fail on empty input
statusReason: Cannot read properties of undefined (reading 'rules')
